
<!DOCTYPE HTML>
<html lang="" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>مسائل ابتدایی جاوا · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="classes-and-objects.html" />
    
    
    <link rel="prev" href="text-editor-or-ide.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="book_README.html">
            
                <a href="book_README.html">
            
                    
                    بیا جاوا یاد بگیریم
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    مقدمه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    نگاهی اجمالی به جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="install-jdk.html">
            
                <a href="install-jdk.html">
            
                    
                    نصب کیت توسعه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="text-editor-or-ide.html">
            
                <a href="text-editor-or-ide.html">
            
                    
                    تکست ادیتور یا آی‌دی‌ای؟
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="basic-subjects.html">
            
                <a href="basic-subjects.html">
            
                    
                    مسائل ابتدایی جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="classes-and-objects.html">
            
                <a href="classes-and-objects.html">
            
                    
                    کلاس‌ها و اشیاء
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    متغیرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="modifiers.html">
            
                <a href="modifiers.html">
            
                    
                    اصلاح کننده‌ها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="operators.html">
            
                <a href="operators.html">
            
                    
                    عملگرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="loops.html">
            
                <a href="loops.html">
            
                    
                    حلقه‌ها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="if-condition.html">
            
                <a href="if-condition.html">
            
                    
                    تصمیم گیری و شرط
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >مسائل ابتدایی جاوا</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x645;&#x633;&#x627;&#x626;&#x644;-&#x627;&#x628;&#x62A;&#x62F;&#x627;&#x6CC;&#x6CC;-&#x62C;&#x627;&#x648;&#x627;">&#x645;&#x633;&#x627;&#x626;&#x644; &#x627;&#x628;&#x62A;&#x62F;&#x627;&#x6CC;&#x6CC; &#x62C;&#x627;&#x648;&#x627;</h1>
<p>&#x627;&#x632; &#x627;&#x6CC;&#x646; &#x642;&#x633;&#x645;&#x62A; &#x6A9;&#x627;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x622;&#x63A;&#x627;&#x632; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;. &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x6A9;&#x645;&#x6CC; &#x67E;&#x6CC;&#x686;&#x6CC;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x648; &#x634;&#x631;&#x648;&#x639; &#x6A9;&#x631;&#x62F;&#x646; &#x622;&#x646; &#x646;&#x642;&#x637;&#x647;&#x200C;&#x6CC; &#x62E;&#x627;&#x635;&#x6CC; &#x646;&#x62F;&#x627;&#x631;&#x62F; &#x648; &#x62D;&#x62A;&#x6CC; &#x62F;&#x631; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x646;&#x6CC;&#x632; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x645;&#x62C;&#x628;&#x648;&#x631; &#x628;&#x627;&#x634;&#x6CC;&#x62F; &#x628;&#x627; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645;&#x6CC; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x627;&#x628;&#x62A;&#x62F;&#x627;&#x6CC;&#x6CC; &#x62F;&#x633;&#x62A; &#x648; &#x67E;&#x646;&#x62C;&#x647; &#x646;&#x631;&#x645; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x627;&#x6AF;&#x631; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x6CC;&#x6A9; &#x62A;&#x627;&#x632;&#x647; &#x648;&#x627;&#x631;&#x62F; &#x62F;&#x631; &#x647;&#x631; &#x6A9;&#x62C;&#x627;&#x6CC; &#x627;&#x6CC;&#x646; &#x6A9;&#x62A;&#x627;&#x628; &#x645;&#x641;&#x647;&#x648;&#x645; &#x6CC;&#x627; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x62E;&#x627;&#x635;&#x6CC; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F; &#x6A9;&#x647; &#x627;&#x62D;&#x633;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x622;&#x646; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x647; &#x646;&#x634;&#x62F;&#x647;&#x60C; &#x645;&#x637;&#x645;&#x626;&#x646; &#x628;&#x627;&#x634;&#x6CC;&#x62F; &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x639;&#x62F;&#x6CC; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x634;&#x62F;&#x60C; &#x632;&#x6CC;&#x631;&#x627; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x646; &#x628;&#x647; &#x686;&#x646;&#x62F; &#x645;&#x648;&#x636;&#x648;&#x639; &#x62F;&#x631; &#x6CC;&#x6A9; &#x628;&#x62E;&#x634; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x62E;&#x633;&#x62A;&#x647; &#x6A9;&#x646;&#x646;&#x62F;&#x647; &#x628;&#x627;&#x634;&#x62F; &#x648; &#x627;&#x632; &#x637;&#x631;&#x641;&#x6CC; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x67E;&#x6CC;&#x634;&#x631;&#x641;&#x62A;&#x647;&#x200C;&#x62A;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x645;&#x631;&#x627;&#x62D;&#x644; &#x627;&#x648;&#x644;&#x6CC;&#x647; &#x6CC;&#x627;&#x62F;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x645;&#x62A;&#x648;&#x62C;&#x647; &#x646;&#x634;&#x648;&#x6CC;&#x62F; &#x648; &#x644;&#x632;&#x648;&#x645; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x646; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x639;&#x62F;&#x6CC; &#x628;&#x627;&#x634;&#x62F;.</p>
<p>&#x62C;&#x627;&#x648;&#x627; &#x6CC;&#x6A9; &#x632;&#x628;&#x627;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x62A;&#x645;&#x627;&#x645;&#x627; &#x634;&#x6CC; &#x6AF;&#x631;&#x627; &#x645;&#x62D;&#x633;&#x648;&#x628; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;&#x60C; &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x647;&#x631; &#x686;&#x6CC;&#x632;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x645;&#x6CC;&#x200C;&#x628;&#x6CC;&#x646;&#x6CC;&#x62F; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x633;&#x62A; &#x648; &#x627;&#x632; &#x647;&#x645;&#x627;&#x646; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x627; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x622;&#x634;&#x646;&#x627; &#x628;&#x627;&#x634;&#x6CC;&#x645;. &#x627;&#x645;&#x627; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x62F;&#x631;&#x6A9; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x627;&#x631;&#x628;&#x631; &#x62A;&#x627;&#x632;&#x647; &#x6A9;&#x627;&#x631; &#x633;&#x627;&#x62F;&#x647; &#x646;&#x628;&#x627;&#x634;&#x62F; &#x648; &#x628;&#x647;&#x62A;&#x631; &#x628;&#x627;&#x634;&#x62F; &#x627;&#x632; &#x645;&#x633;&#x627;&#x626;&#x644; &#x633;&#x627;&#x62F;&#x647;&#x200C;&#x62A;&#x631; &#x634;&#x631;&#x648;&#x639; &#x628;&#x647; &#x6CC;&#x627;&#x62F;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x645;. &#x628;&#x647; &#x647;&#x645;&#x6CC;&#x646; &#x645;&#x646;&#x638;&#x648;&#x631; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x642;&#x633;&#x645;&#x62A; &#x635;&#x631;&#x641;&#x627; &#x628;&#x627; &#x628;&#x631;&#x62E;&#x6CC; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x622;&#x634;&#x646;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x62F; &#x6A9;&#x647; &#x648; &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x622;&#x6CC;&#x646;&#x62F;&#x647; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x62C;&#x62F;&#x6CC;&#x200C;&#x62A;&#x631; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;.</p>
<h3 id="what-is-object">&#x634;&#x6CC; &#x686;&#x6CC;&#x633;&#x62A;&#x61F; </h3>
<p>&#x62D;&#x62A;&#x645;&#x627; &#x647;&#x645;&#x6CC;&#x646; &#x62D;&#x627;&#x644;&#x627; &#x6A9;&#x647; &#x62F;&#x631; &#x62D;&#x627;&#x644; &#x645;&#x637;&#x627;&#x644;&#x639;&#x647;&#x200C;&#x6CC; &#x627;&#x6CC;&#x646; &#x6A9;&#x62A;&#x627;&#x628; &#x647;&#x633;&#x62A;&#x6CC;&#x62F;&#x60C; &#x627;&#x634;&#x6CC;&#x627;&#x6CC; &#x632;&#x6CC;&#x627;&#x62F;&#x6CC; &#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x62F;&#x631; &#x627;&#x637;&#x631;&#x627;&#x641; &#x62E;&#x648;&#x62F; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62B;&#x627;&#x644; &#x6CC;&#x6A9; &#x62E;&#x648;&#x62F;&#x6A9;&#x627;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x628;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x62F;. &#x62A;&#x645;&#x627;&#x645; &#x627;&#x634;&#x6CC;&#x627; &#x62A;&#x639;&#x62F;&#x627;&#x62F;&#x6CC; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC; &#x648; &#x62A;&#x639;&#x62F;&#x627;&#x62F;&#x6CC; &#x631;&#x641;&#x62A;&#x627;&#x631; &#x62F;&#x627;&#x631;&#x646;&#x62F;&#x60C; &#x6CC;&#x6A9; &#x62E;&#x648;&#x62F;&#x6A9;&#x627;&#x631; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x631;&#x646;&#x6AF;&#x60C; &#x62C;&#x646;&#x633; &#x628;&#x62F;&#x646;&#x647; &#x648; ... &#x62F;&#x627;&#x631;&#x62F; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x6CC; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x646;&#x648;&#x634;&#x62A;&#x646; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x62F;. &#x627;&#x634;&#x6CC;&#x627; &#x62F;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x646;&#x6CC;&#x632; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x647; &#x647;&#x645;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x639;&#x645;&#x644; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x646;&#x62F;&#x60C; &#x6CC;&#x639;&#x646;&#x6CC; &#x627;&#x632; &#x62A;&#x639;&#x62F;&#x627;&#x62F;&#x6CC; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631; &#x62A;&#x634;&#x6A9;&#x6CC;&#x644; &#x634;&#x62F;&#x647;&#x200C;&#x627;&#x646;&#x62F; &#x648; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x6A9;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x646;&#x62F;. </p>
<h3 id="what-is-class">&#x6A9;&#x644;&#x627;&#x633; &#x686;&#x6CC;&#x633;&#x62A;&#x61F; </h3>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x6AF;&#x641;&#x62A;&#x6CC;&#x645; &#x62A;&#x645;&#x627;&#x645; &#x627;&#x634;&#x6CC;&#x627; &#x62A;&#x639;&#x62F;&#x627;&#x62F;&#x6CC; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631; &#x62F;&#x627;&#x631;&#x646;&#x62F;&#x60C; &#x62A;&#x645;&#x627;&#x645; &#x627;&#x6CC;&#x646; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;. &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x637;&#x631;&#x62D;&#x200C;&#x647;&#x627; &#x6CC;&#x627; &#x646;&#x645;&#x648;&#x646;&#x647;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x627;&#x632; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x627;&#x634;&#x6CC;&#x627; &#x631;&#x627; &#x633;&#x627;&#x62E;&#x62A;. &#x647;&#x631; &#x634;&#x6CC;&#x200C;&#x627;&#x6CC; &#x62A;&#x645;&#x627;&#x645; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x62F;&#x627;&#x631;&#x62F; &#x648; &#x628;&#x631;&#x62E;&#x6CC; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x627;&#x631;&#x62F; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x642;&#x627;&#x628;&#x644; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x646;&#x62F;. &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x644;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x62E;&#x62A; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x644;&#x627;&#x632;&#x645; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x631;&#x628;&#x648;&#x637; &#x628;&#x647; &#x634;&#x6CC; &#x631;&#x627; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x634;&#x6CC; &#x631;&#x627; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x622;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x6A9;&#x646;&#x6CC;&#x62F;. </p>
<h3 id="what-is-method">&#x645;&#x62A;&#x62F; &#x686;&#x6CC;&#x633;&#x62A;&#x61F; </h3>
<p>&#x645;&#x62A;&#x62F;&#x647;&#x627; &#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x631;&#x641;&#x62A;&#x627;&#x631; &#x634;&#x6CC; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x6AF;&#x631;&#x641;&#x62A;. &#x645;&#x639;&#x645;&#x648;&#x644;&#x627; &#x647;&#x631; &#x645;&#x62A;&#x62F; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x6A9;&#x627;&#x631; &#x6CC;&#x627; &#x6A9;&#x627;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x62F; &#x648; &#x62F;&#x631; &#x646;&#x647;&#x627;&#x6CC;&#x62A; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x628;&#x631;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F; &#x6CC;&#x627; &#x628;&#x631;&#x646;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F;. &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x645;&#x639;&#x645;&#x648;&#x644;&#x627; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;.</p>
<h3 id="instance-variable">&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; </h3>
<p>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647;&#x60C; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC; &#x627;&#x634;&#x6CC;&#x627; &#x631;&#x627; &#x62A;&#x634;&#x6A9;&#x6CC;&#x644; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x646;&#x62F;. &#x627;&#x6CC;&#x646; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627; &#x646;&#x6CC;&#x632; &#x62F;&#x631;&#x648;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x642;&#x631;&#x627;&#x631; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x646;&#x62F; &#x648; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x642;&#x627;&#x628;&#x644; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x646;&#x62F; &#x6CC;&#x627; &#x646;&#x628;&#x627;&#x634;&#x646;&#x62F;.</p>
<p>&#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x639;&#x62F;&#x6CC; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x645;&#x641;&#x635;&#x644;&#x200C;&#x62A;&#x631; &#x628;&#x647; &#x627;&#x6CC;&#x646; &#x645;&#x633;&#x627;&#x626;&#x644; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x634;&#x62F;.</p>
<h3 id="first-program-in-java">&#x627;&#x648;&#x644;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x628;&#x647; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; </h3>
<p>&#x645;&#x639;&#x645;&#x648;&#x644;&#x627; &#x648;&#x642;&#x62A;&#x6CC; &#x634;&#x631;&#x648;&#x639; &#x628;&#x647; &#x6CC;&#x627;&#x62F;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x6CC;&#x6A9; &#x632;&#x628;&#x627;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x627;&#x648;&#x644;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;&#x60C; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x627;&#x6CC; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x6CC;&#x6A9; &#x645;&#x62A;&#x646; &#x631;&#x627; &#x686;&#x627;&#x67E; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Hello</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span> </span>{
        System.out.println(<span class="hljs-string">&quot;Hello World&quot;</span>);
    }
}
</code></pre>
<p>&#x647;&#x631; &#x62E;&#x637; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x627;&#x645;&#x644;&#x627; &#x62E;&#x644;&#x627;&#x635;&#x647; &#x62A;&#x648;&#x636;&#x6CC;&#x62D; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x645; &#x648; &#x634;&#x645;&#x627; &#x646;&#x6CC;&#x632; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x6A9;&#x646;&#x62C;&#x6A9;&#x627;&#x648;&#x6CC; &#x646;&#x6A9;&#x646;&#x6CC;&#x62F; &#x632;&#x6CC;&#x631;&#x627; &#x628;&#x647; &#x632;&#x648;&#x62F;&#x6CC; &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x67E;&#x6CC;&#x634;&#x200C;&#x631;&#x648; &#x62A;&#x6A9; &#x62A;&#x6A9; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x631;&#x627; &#x6A9;&#x647; &#x62F;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x645;&#x6CC;&#x200C;&#x628;&#x6CC;&#x646;&#x6CC;&#x62F; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x641;&#x647;&#x645;&#x6CC;&#x62F;.</p>
<p>&#x62E;&#x637; &#x627;&#x648;&#x644; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627; &#x646;&#x627;&#x645; Hello &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. </p>
<p>&#x62E;&#x637; &#x62F;&#x648;&#x645; &#x645;&#x62A;&#x62F; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;.</p>
<p>&#x62E;&#x637; &#x633;&#x648;&#x645; &#x62A;&#x627;&#x628;&#x639; &#x686;&#x627;&#x67E; &#x631;&#x627; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x6A9;&#x647; &#x639;&#x628;&#x627;&#x631;&#x62A; Hello World &#x631;&#x627; &#x686;&#x627;&#x67E; &#x6A9;&#x646;&#x62F;. </p>
<h3 id="compile-and-run">&#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x648; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; </h3>
<p>&#x62D;&#x627;&#x644; &#x627;&#x6AF;&#x631; &#x628;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x627;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645; &#x6A9;&#x627;&#x641;&#x6CC; &#x627;&#x633;&#x62A; &#x6CC;&#x6A9; &#x648;&#x6CC;&#x631;&#x627;&#x6CC;&#x634;&#x200C;&#x6AF;&#x631; &#x645;&#x62A;&#x646; &#x628;&#x627;&#x632; &#x6A9;&#x646;&#x6CC;&#x645; &#x648; &#x622;&#x646; &#x631;&#x627; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x641;&#x627;&#x6CC;&#x644; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x645;. &#x633;&#x67E;&#x633; &#x641;&#x627;&#x6CC;&#x644; &#x631;&#x627; &#x628;&#x627; &#x646;&#x627;&#x645; Hello.java &#x630;&#x62E;&#x6CC;&#x631;&#x647; &#x6A9;&#x646;&#x6CC;&#x645;. &#x67E;&#x633; &#x627;&#x632; &#x630;&#x62E;&#x6CC;&#x631;&#x647; &#x6A9;&#x631;&#x62F;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x647; &#x633;&#x631;&#x627;&#x63A; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62C;&#x627;&#x648;&#x627; (Javac) &#x6A9;&#x647; &#x67E;&#x6CC;&#x634;&#x200C;&#x62A;&#x631; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x634;&#x62F;&#x60C; &#x628;&#x631;&#x648;&#x6CC;&#x645; &#x648; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x645;. &#x646;&#x62D;&#x648;&#x647;&#x200C;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6CC;&#x6A9; &#x641;&#x627;&#x6CC;&#x644; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-text">javac file.java
</code></pre>
<p>&#x645;&#x62B;&#x644;&#x627; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x627;&#x644;&#x627; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C;  ~ javac Hello.java
&#x279C;  ~
</code></pre>
<p>&#x648;&#x642;&#x62A;&#x6CC; &#x67E;&#x633; &#x627;&#x632; &#x632;&#x62F;&#x646; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646; &#x634;&#x645;&#x627; &#x628;&#x647; &#x62E;&#x637; &#x628;&#x639;&#x62F;&#x6CC; &#x647;&#x62F;&#x627;&#x6CC;&#x62A; &#x634;&#x62F;&#x60C; &#x6CC;&#x639;&#x646;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x634;&#x645;&#x627; &#x62F;&#x631; &#x646;&#x648;&#x634;&#x62A;&#x627;&#x631; &#x645;&#x634;&#x6A9;&#x644;&#x6CC; &#x646;&#x62F;&#x627;&#x631;&#x62F; &#x648; &#x628;&#x647; &#x62F;&#x631;&#x633;&#x62A;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;.</p>
<p>&#x62D;&#x627;&#x644;&#x627; &#x627;&#x6AF;&#x631; &#x628;&#x647; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x62E;&#x648;&#x62F; &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x6A9;&#x631;&#x62F; &#x6A9;&#x647; &#x641;&#x627;&#x6CC;&#x644;&#x6CC; &#x628;&#x627; &#x647;&#x645;&#x627;&#x646; &#x646;&#x627;&#x645; &#x648; &#x628;&#x627; &#x67E;&#x633;&#x648;&#x646;&#x62F; class &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-text">&#x279C;  ~ ls
Hello.java       Hello.class
</code></pre>
<p>(&#x62F;&#x631; &#x645;&#x648;&#x631;&#x62F; &#x627;&#x6CC;&#x646; &#x646;&#x648;&#x639; &#x62E;&#x631;&#x648;&#x62C;&#x6CC;&#x200C;&#x647;&#x627; &#x648; prompt &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646; &#x62E;&#x648;&#x62F;&#x645; &#x62F;&#x631; &#x67E;&#x631;&#x627;&#x646;&#x62A;&#x632; &#x628;&#x6AF;&#x648;&#x6CC;&#x645; &#x6A9;&#x647; &#x645;&#x646; &#x627;&#x632; &#x634;&#x644; zsh &#x648; &#x641;&#x631;&#x6CC;&#x645;&#x200C;&#x648;&#x631;&#x6A9; oh my zsh &#x631;&#x648;&#x6CC; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644; &#x6AF;&#x646;&#x648;/&#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x645;. &#x648; &#x641;&#x631;&#x645;&#x627;&#x646; &#x648; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x631;&#x627; &#x628;&#x647; &#x647;&#x645;&#x627;&#x646; &#x634;&#x6A9;&#x644;&#x6CC; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x645;&#x60C; &#x6A9;&#x67E;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x645; &#x62A;&#x627; &#x634;&#x645;&#x627; &#x646;&#x6CC;&#x632; &#x628;&#x628;&#x6CC;&#x646;&#x6CC;&#x62F; &#x686;&#x647; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x6CC; &#x627;&#x62C;&#x631;&#x627; &#x634;&#x62F;&#x647; &#x648; &#x62E;&#x631;&#x648;&#x62C;&#x6CC;&#x200C;&#x627;&#x634; &#x686;&#x647; &#x628;&#x648;&#x62F;. &#x627;&#x645;&#x627; &#x646;&#x648;&#x639; &#x634;&#x644; &#x648; &#x634;&#x6A9;&#x644; &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646; &#x647;&#x6CC;&#x686; &#x627;&#x631;&#x62A;&#x628;&#x627;&#x637;&#x6CC; &#x628;&#x647; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x627;&#x62A; &#x646;&#x62F;&#x627;&#x631;&#x62F; &#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x627;&#x62A; &#x62C;&#x627;&#x648;&#x627; &#x647;&#x645;&#x686;&#x648;&#x646; javac &#x648; java &#x628;&#x627; &#x647;&#x631; &#x634;&#x644; &#x648; &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646;&#x6CC; &#x627;&#x62C;&#x631;&#x627; &#x648; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x645;&#x634;&#x627;&#x628;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x62F;&#x627;&#x634;&#x62A;.</p>
<p>&#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x645;&#x62B;&#x627;&#x644; &#x62F;&#x631; &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646; &#x648;&#x6CC;&#x646;&#x62F;&#x648;&#x632;&#x60C; prompt &#x634;&#x645;&#x627; &#x627;&#x6CC;&#x646;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x627;&#x633;&#x62A; &#x648; &#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x646;&#x648;&#x634;&#x62A;&#x6CC;&#x645; &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x628;&#x648;&#x62F; (&#x628;&#x627; &#x641;&#x631;&#x636; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x641;&#x627;&#x6CC;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x62F;&#x631; &#x62F;&#x631;&#x627;&#x6CC;&#x648;&#x631; C &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x631;&#x62F;.) :</p>
<pre><code class="lang-text">C:\&gt; javac Hello.java 
C:\&gt;
</code></pre>
<p>)</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x628;&#x627;&#x6CC;&#x62F; &#x627;&#x632; &#x641;&#x631;&#x645;&#x627;&#x646; java &#x6A9;&#x645;&#x6A9; &#x628;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x645; &#x6A9;&#x647; &#x622;&#x646; &#x646;&#x6CC;&#x632; &#x62F;&#x631; &#x642;&#x633;&#x645;&#x62A; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x634;&#x62F;. &#x646;&#x62D;&#x648;&#x647;&#x200C;&#x6CC; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x631;&#x62F;&#x646; &#x6CC;&#x6A9; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x634;&#x62F;&#x647; &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-text">java name
</code></pre>
<p>&#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x634;&#x62F;&#x647; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x646;&#x628;&#x627;&#x6CC;&#x62F; &#x67E;&#x633;&#x648;&#x646;&#x62F;&#x6CC; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x647;&#x6CC;&#x62F; &#x648; &#x6A9;&#x627;&#x641;&#x6CC; &#x627;&#x633;&#x62A; &#x67E;&#x633; &#x627;&#x632; &#x641;&#x631;&#x645;&#x627;&#x646; java &#x641;&#x642;&#x637; &#x627;&#x633;&#x645; &#x641;&#x627;&#x6CC;&#x644; &#x631;&#x627; &#x628;&#x62F;&#x648;&#x646; &#x647;&#x6CC;&#x686;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x645;&#x648;&#x631;&#x62F; &#x627;&#x636;&#x627;&#x641;&#x6CC; (&#x627;&#x632; &#x62C;&#x645;&#x644;&#x647; &#x67E;&#x633;&#x648;&#x646;&#x62F; &#x622;&#x646;) &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62B;&#x627;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x646;&#x648;&#x634;&#x62A;&#x6CC;&#x645; &#x648; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645; &#x631;&#x627; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x645;&#x631;&#x62D;&#x644;&#x647; &#x627;&#x62C;&#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C;  ~ java Hello 
Hello World
</code></pre>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x634;&#x627;&#x647;&#x62F; &#x62E;&#x631;&#x648;&#x62C;&#x6CC;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631; &#x62F;&#x627;&#x634;&#x62A;&#x6CC;&#x645; &#x647;&#x633;&#x62A;&#x6CC;&#x645;.</p>
<h3 id="compiler-reaction-to-incorrect">&#x639;&#x6A9;&#x633; &#x627;&#x644;&#x639;&#x645;&#x644; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x646;&#x633;&#x628;&#x62A; &#x628;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x627;&#x634;&#x62A;&#x628;&#x627;&#x647; </h3>
<p>&#x627;&#x6AF;&#x631; &#x62F;&#x631; &#x642;&#x633;&#x645;&#x62A;&#x6CC; &#x627;&#x632; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x627;&#x634;&#x62A;&#x628;&#x627;&#x647; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x6CC;&#x62F;&#x60C; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x632;&#x645;&#x627;&#x646;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x628;&#x647; &#x62E;&#x637; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x627;&#x634;&#x62A;&#x628;&#x627;&#x647; &#x628;&#x631;&#x633;&#x62F;&#x60C; &#x647;&#x645;&#x627;&#x646;&#x200C;&#x62C;&#x627; &#x639;&#x645;&#x644;&#x6CC;&#x627;&#x62A; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x631;&#x627; &#x645;&#x62A;&#x648;&#x642;&#x641; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x648; &#x633;&#x639;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x634;&#x645;&#x627; &#x631;&#x627; &#x627;&#x632; &#x62E;&#x637;&#x627;&#x6CC; &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x622;&#x6AF;&#x627;&#x647; &#x6A9;&#x646;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62B;&#x627;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x628;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> clas Hello {
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span> </span>{
        System.out.println(<span class="hljs-string">&quot;Hello World&quot;</span>);
    }
}
</code></pre>
<p>&#x62F;&#x631; &#x62E;&#x637; &#x627;&#x648;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x627;&#x644;&#x627; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &quot;class&quot; &#x628;&#x647; &#x634;&#x6A9;&#x644; &#x63A;&#x644;&#x637; &quot;clas&quot; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;. &#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x633;&#x639;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x645; &#x622;&#x646;&#x200C;&#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x645; &#x648; &#x646;&#x62A;&#x6CC;&#x62C;&#x647; &#x631;&#x627; &#x628;&#x628;&#x6CC;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C;  ~ javac Hello.java 
Hello.java:1: error: class, interface, or enum expected
public clas Hello {
       ^
Hello.java:2: error: class, interface, or enum expected
        public static void main(String []args) {
                      ^
Hello.java:4: error: class, interface, or enum expected
        }
        ^
3 errors
</code></pre>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x628;&#x6CC;&#x646;&#x6CC;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x646;&#x634;&#x62F; &#x648; &#x633;&#x647; &#x62E;&#x637;&#x627; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645; &#x6A9;&#x647; &#x628;&#x647; &#x62A;&#x631;&#x62A;&#x6CC;&#x628; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x67E;&#x631;&#x62F;&#x627;&#x632;&#x6CC;&#x645;:</p>
<p>&#x646;&#x62D;&#x648;&#x647;&#x200C;&#x6CC; &#x646;&#x645;&#x627;&#x6CC;&#x634; &#x62E;&#x637;&#x627; &#x62F;&#x631; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x62F;&#x631; &#x62E;&#x637; &#x627;&#x648;&#x644; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x646;&#x627;&#x645; &#x641;&#x627;&#x6CC;&#x644;&#x60C; &#x633;&#x67E;&#x633; &#x62E;&#x637;&#x6CC; &#x6A9;&#x647; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x645;&#x634;&#x6A9;&#x644; &#x627;&#x633;&#x62A; &#x648; &#x67E;&#x633; &#x627;&#x632; &#x622;&#x646; &#x646;&#x648;&#x639; &#x62E;&#x637;&#x627; &#x631;&#x627; &#x628;&#x647; &#x645;&#x627; &#x646;&#x645;&#x627;&#x6CC;&#x634; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x62F;. &#x62F;&#x631; &#x62E;&#x637;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x639;&#x62F;&#x6CC; &#x628;&#x647; &#x642;&#x633;&#x645;&#x62A;&#x6CC; &#x6A9;&#x647; &#x628;&#x627;&#x639;&#x62B; &#x631;&#x62E; &#x62F;&#x627;&#x62F;&#x646; &#x62E;&#x637;&#x627;&#x6CC; &#x645;&#x631;&#x628;&#x648;&#x637;&#x647; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x627;&#x634;&#x627;&#x631;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;.</p>
<p><strong>&#x62E;&#x637;&#x627;&#x6CC; &#x627;&#x648;&#x644;:</strong> &#x647;&#x645;&#x627;&#x646;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x647; &#x627;&#x632; &#x645;&#x62A;&#x646; &#x62E;&#x637;&#x627; &#x645;&#x634;&#x62E;&#x635; &#x627;&#x633;&#x62A;&#x60C; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x6CC;&#x627; &#x627;&#x6CC;&#x646;&#x62A;&#x631;&#x641;&#x6CC;&#x633; &#x6CC;&#x627; enum &#x631;&#x627; &#x628;&#x647; &#x62C;&#x627;&#x6CC; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; clas &#x62F;&#x627;&#x631;&#x62F;.</p>
<p><strong>&#x62E;&#x637;&#x627;&#x6CC; &#x62F;&#x648;&#x645;:</strong> &#x645;&#x62A;&#x646; &#x62E;&#x637;&#x627; &#x645;&#x634;&#x627;&#x628;&#x647; &#x627;&#x648;&#x644;&#x6CC;&#x646; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646;&#x62C;&#x627; &#x627;&#x634;&#x627;&#x631;&#x647;&#x200C;&#x6CC; &#x62E;&#x637;&#x627; &#x628;&#x647; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; void &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x6A9;&#x644;&#x645;&#x627;&#x62A; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x645;&#x62A;&#x62F; &#x627;&#x633;&#x62A;. (&#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x645;&#x631;&#x628;&#x648;&#x637; &#x628;&#x647; &#x645;&#x62A;&#x62F; &#x628;&#x627; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x622;&#x634;&#x646;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x634;&#x62F;.) &#x648; &#x62F;&#x648;&#x628;&#x627;&#x631;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631;&#x627;&#x62A; &#x628;&#x627;&#x644;&#x627; &#x631;&#x627; &#x627;&#x632; &#x645;&#x627; &#x62F;&#x627;&#x631;&#x62F; &#x632;&#x6CC;&#x631;&#x627; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x639;&#x645;&#x648;&#x645;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x62F;&#x631;&#x648;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x634;&#x648;&#x62F;. </p>
<p><strong>&#x62E;&#x637;&#x627;&#x6CC; &#x633;&#x648;&#x645;:</strong> &#x648; &#x627;&#x645;&#x627; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x62F;&#x648; &#x62E;&#x637;&#x627;&#x6CC; &#x62F;&#x6CC;&#x6AF;&#x631;&#x60C; &#x645;&#x62A;&#x646; &#x627;&#x6CC;&#x646; &#x62E;&#x637;&#x627; &#x646;&#x6CC;&#x632; &#x645;&#x634;&#x627;&#x628;&#x647; &#x627;&#x633;&#x62A;&#x60C; &#x627;&#x645;&#x627; &#x627;&#x634;&#x627;&#x631;&#x647;&#x200C;&#x6CC; &#x622;&#x646; &#x628;&#x647; &#x6A9;&#x627;&#x631;&#x627;&#x6A9;&#x62A;&#x631; &quot; { &quot; &#x62F;&#x631; &#x62E;&#x637; &#x686;&#x647;&#x627;&#x631;&#x645; &#x627;&#x633;&#x62A;. &#x62F;&#x648; &#x6A9;&#x627;&#x631;&#x627;&#x6A9;&#x62A;&#x631; &quot; } &quot; &#x648; &quot; { &quot; &#x628;&#x631;&#x627;&#x6CC; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x645;&#x62D;&#x644; &#x634;&#x631;&#x648;&#x639; &#x648; &#x67E;&#x627;&#x6CC;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;&#x60C; &#x62A;&#x648;&#x627;&#x628;&#x639;&#x60C; &#x634;&#x631;&#x637;&#x200C;&#x647;&#x627;&#x60C; &#x62D;&#x644;&#x642;&#x647;&#x200C;&#x647;&#x627; &#x648; &#x633;&#x627;&#x6CC;&#x631; &#x628;&#x644;&#x648;&#x6A9; &#x6A9;&#x62F;&#x200C;&#x647;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646;&#x62C;&#x627; &#x647;&#x62F;&#x641; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62F;&#x631; &#x62E;&#x637; &#x686;&#x647;&#x627;&#x631;&#x645; &#x686;&#x6CC;&#x632;&#x6CC; &#x628;&#x647; &#x62C;&#x632; &#x645;&#x62A;&#x62F; main &#x645;&#x627; &#x646;&#x6CC;&#x633;&#x62A;. &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x686;&#x648;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x648;&#x62C;&#x648;&#x62F; &#x646;&#x62F;&#x627;&#x631;&#x62F;&#x60C; &#x645;&#x62A;&#x62F;&#x6CC; &#x646;&#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F; &#x648; &#x648;&#x642;&#x62A;&#x6CC; &#x645;&#x62A;&#x62F;&#x6CC; &#x648;&#x62C;&#x648;&#x62F; &#x646;&#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F; &#x646;&#x642;&#x637;&#x647;&#x200C;&#x6CC; &#x67E;&#x627;&#x6CC;&#x627;&#x646;&#x6CC; &#x646;&#x6CC;&#x632; &#x646;&#x62F;&#x627;&#x631;&#x62F; !</p>
<p>&#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x62E;&#x637;&#x627;&#x647;&#x627; &#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x628;&#x627; &#x62E;&#x648;&#x627;&#x646;&#x62F;&#x646; &#x645;&#x62A;&#x646; &#x62E;&#x637;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x628;&#x647; &#x645;&#x627; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x62F;&#x60C; &#x62A;&#x635;&#x62D;&#x6CC;&#x62D; &#x6A9;&#x631;&#x62F;. &#x647;&#x645;&#x6CC;&#x634;&#x647; &#x628;&#x647;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x641;&#x639; &#x62E;&#x637;&#x627; &#x627;&#x632; &#x627;&#x648;&#x644;&#x6CC;&#x646; &#x62E;&#x637;&#x627; &#x631;&#x641;&#x639; &#x6A9;&#x631;&#x62F;&#x646; &#x622;&#x646; &#x631;&#x627; &#x622;&#x63A;&#x627;&#x632; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x62F;&#x648;&#x628;&#x627;&#x631;&#x647; &#x622;&#x646; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x627;&#x6AF;&#x631; &#x645;&#x62C;&#x62F;&#x62F; &#x62E;&#x637;&#x627;&#x6CC;&#x6CC; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F; &#x62F;&#x648; &#x645;&#x631;&#x62D;&#x644;&#x647;&#x200C;&#x6CC; &#x642;&#x628;&#x644; &#x6CC;&#x639;&#x646;&#x6CC; &#x631;&#x641;&#x639; &#x62E;&#x637;&#x627; &#x648; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x631;&#x627; &#x645;&#x62C;&#x62F;&#x62F; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x6CC;&#x62F; &#x648; &#x628;&#x647; &#x647;&#x645;&#x6CC;&#x646; &#x62A;&#x631;&#x62A;&#x6CC;&#x628; &#x622;&#x646;&#x200C;&#x642;&#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x62F;&#x647;&#x6CC;&#x62F; &#x62A;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x645;&#x648;&#x641;&#x642;&#x6CC;&#x62A; &#x622;&#x645;&#x6CC;&#x632; &#x628;&#x627;&#x634;&#x62F;.</p>
<p> &#x62F;&#x631; &#x627;&#x6CC;&#x646;&#x62C;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x641;&#x639; &#x62E;&#x637;&#x627; &#x6A9;&#x627;&#x641;&#x6CC;&#x200C;&#x627;&#x633;&#x62A; &#x62F;&#x631; &#x62E;&#x637; &#x627;&#x648;&#x644; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; clas &#x631;&#x627; &#x628;&#x627; class &#x62C;&#x627;&#x6CC;&#x6AF;&#x632;&#x6CC;&#x646; &#x6A9;&#x646;&#x6CC;&#x645; &#x648; &#x67E;&#x633; &#x627;&#x632; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x645;&#x62C;&#x62F;&#x62F; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x62F;&#x6CC;&#x62F; &#x6A9;&#x647; &#x62F;&#x648; &#x62E;&#x637;&#x627;&#x6CC; &#x62F;&#x6CC;&#x6AF;&#x631; &#x646;&#x6CC;&#x632; &#x631;&#x641;&#x639; &#x634;&#x62F;&#x647;&#x200C;&#x627;&#x646;&#x62F; &#x632;&#x6CC;&#x631;&#x627; &#x622;&#x646; &#x62F;&#x648; &#x628;&#x647; &#x639;&#x644;&#x62A; &#x62E;&#x637;&#x627;&#x6CC; &#x67E;&#x6CC;&#x634; &#x622;&#x645;&#x62F;&#x647; &#x62F;&#x631; &#x642;&#x633;&#x645;&#x62A; &#x627;&#x648;&#x644;&#x60C; &#x62F;&#x686;&#x627;&#x631; &#x645;&#x634;&#x6A9;&#x644; &#x634;&#x62F;&#x647; &#x628;&#x648;&#x62F;&#x646;&#x62F;.  </p>
<h3 id="&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;">&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;</h3>
<p>&#x633;&#x627;&#x62F;&#x647; &#x62A;&#x631;&#x6CC;&#x646; &#x634;&#x631;&#x62D; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627; &#x6A9;&#x627;&#x631; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x627;&#x633;&#x62A;! &#x6A9;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627; &#x646;&#x6AF;&#x647;&#x200C;&#x62F;&#x627;&#x631;&#x6CC; &#x62F;&#x627;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x628;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x628;&#x647; &#x646;&#x648;&#x639; &#x62F;&#x627;&#x62F;&#x647; &#x648; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x622;&#x646; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x6CC;&#x62F;&#x60C; &#x627;&#x633;&#x62A;. </p>
<p>&#x633;&#x647; &#x646;&#x648;&#x639; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x646;&#x62F; &#x6A9;&#x647; &#x639;&#x628;&#x627;&#x631;&#x62A;&#x200C;&#x627;&#x646;&#x62F; &#x627;&#x632;:</p>
<p>&#x6F1;. <strong>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x62D;&#x644;&#x6CC;</strong></p>
<p>&#x6F2;. <strong>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; (&#x627;&#x633;&#x62A;&#x627;&#x62A;&#x6CC;&#x6A9;)</strong></p>
<p>&#x6F3;. <strong>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; (&#x63A;&#x6CC;&#x631; &#x627;&#x633;&#x62A;&#x627;&#x62A;&#x6CC;&#x6A9;)</strong></p>
<h3 id="&#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627;-&#x62F;&#x631;-&#x62C;&#x627;&#x648;&#x627;">&#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627;</h3>
<p>&#x62A;&#x645;&#x627;&#x645; &#x627;&#x62C;&#x632;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x646;&#x6CC;&#x627;&#x632; &#x628;&#x647; &#x634;&#x646;&#x627;&#x633;&#x647; &#x62F;&#x627;&#x631;&#x646;&#x62F;. &#x634;&#x646;&#x627;&#x633;&#x647; &#x646;&#x627;&#x645;&#x6CC; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x60C; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;. &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x642;&#x627;&#x646;&#x648;&#x646; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x646;&#x627;&#x645; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x628;&#x647; &#x622;&#x646; &#x645;&#x6CC;&#x200C;&#x67E;&#x631;&#x62F;&#x627;&#x632;&#x6CC;&#x645;.</p>
<p>&#x6F1;. &#x646;&#x627;&#x645; &#x62A;&#x645;&#x627;&#x645; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x627; &#x6CC;&#x6A9; &#x62D;&#x631;&#x641; (&#x627;&#x632; A &#x62A;&#x627; Z &#x6CC;&#x627; &#x627;&#x632; a &#x62A;&#x627; z)&#x60C; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x62F;&#x644;&#x627;&#x631; ($) &#x6CC;&#x627; &#x6CC;&#x6A9; &#x622;&#x646;&#x62F;&#x631;&#x644;&#x627;&#x6CC;&#x646; (_) &#x622;&#x63A;&#x627;&#x632; &#x634;&#x648;&#x62F;.</p>
<p>&#x6F2;. &#x67E;&#x633; &#x627;&#x632; &#x6A9;&#x627;&#x631;&#x627;&#x6A9;&#x62A;&#x631; &#x627;&#x648;&#x644;&#x60C; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x647;&#x631; &#x62A;&#x631;&#x6A9;&#x6CC;&#x628;&#x6CC; &#x627;&#x632; &#x62D;&#x631;&#x648;&#x641; &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x646;&#x62F;.</p>
<p>&#x6F3;. &#x6A9;&#x644;&#x645;&#x627;&#x62A; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x646;&#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x634;&#x648;&#x646;&#x62F;.</p>
<p>&#x6F4;. &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627; &#x628;&#x647; &#x62D;&#x631;&#x648;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x648; &#x6A9;&#x648;&#x686;&#x6A9; &#x62D;&#x633;&#x627;&#x633; &#x647;&#x633;&#x62A;&#x646;&#x62F;.</p>
<h3 id="&#x6A9;&#x644;&#x645;&#x627;&#x62A;-&#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC;-&#x62C;&#x627;&#x648;&#x627;">&#x6A9;&#x644;&#x645;&#x627;&#x62A; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x62C;&#x627;&#x648;&#x627;</h3>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x630;&#x6A9;&#x631; &#x634;&#x62F; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x631;&#x627; &#x646;&#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x634;&#x646;&#x627;&#x633;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62E;&#x648;&#x62F; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x62F;&#x631; &#x62C;&#x62F;&#x648;&#x644; &#x632;&#x6CC;&#x631; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x62A;&#x645;&#x627;&#x645;&#x6CC; &#x627;&#x6CC;&#x646; &#x6A9;&#x644;&#x645;&#x627;&#x62A; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; &#x631;&#x627; &#x628;&#x647; &#x62A;&#x631;&#x62A;&#x6CC;&#x628; &#x62D;&#x631;&#x648;&#x641; &#x627;&#x644;&#x641;&#x628;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<table>
<thead>
<tr>
<th style="text-align:left"></th>
<th style="text-align:left"></th>
<th style="text-align:left"></th>
<th style="text-align:left"></th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left"><code>abstract</code></td>
<td style="text-align:left"><code>assert</code></td>
<td style="text-align:left"><code>boolean</code></td>
<td style="text-align:left"><code>break</code></td>
</tr>
<tr>
<td style="text-align:left"><code>byte</code></td>
<td style="text-align:left"><code>case</code></td>
<td style="text-align:left"><code>catch</code></td>
<td style="text-align:left"><code>char</code></td>
</tr>
<tr>
<td style="text-align:left"><code>class</code></td>
<td style="text-align:left"><code>const</code></td>
<td style="text-align:left"><code>continue</code></td>
<td style="text-align:left"><code>default</code></td>
</tr>
<tr>
<td style="text-align:left"><code>do</code></td>
<td style="text-align:left"><code>double</code></td>
<td style="text-align:left"><code>else</code></td>
<td style="text-align:left"><code>enum</code></td>
</tr>
<tr>
<td style="text-align:left"><code>extends</code></td>
<td style="text-align:left"><code>final</code></td>
<td style="text-align:left"><code>finally</code></td>
<td style="text-align:left"><code>float</code></td>
</tr>
<tr>
<td style="text-align:left"><code>for</code></td>
<td style="text-align:left"><code>goto</code></td>
<td style="text-align:left"><code>if</code></td>
<td style="text-align:left"><code>implements</code></td>
</tr>
<tr>
<td style="text-align:left"><code>import</code></td>
<td style="text-align:left"><code>instanceof</code></td>
<td style="text-align:left"><code>int</code></td>
<td style="text-align:left"><code>interface</code></td>
</tr>
<tr>
<td style="text-align:left"><code>long</code></td>
<td style="text-align:left"><code>native</code></td>
<td style="text-align:left"><code>new</code></td>
<td style="text-align:left"><code>package</code></td>
</tr>
<tr>
<td style="text-align:left"><code>private</code></td>
<td style="text-align:left"><code>protected</code></td>
<td style="text-align:left"><code>public</code></td>
<td style="text-align:left"><code>return</code></td>
</tr>
<tr>
<td style="text-align:left"><code>short</code></td>
<td style="text-align:left"><code>static</code></td>
<td style="text-align:left"><code>strictfp</code></td>
<td style="text-align:left"><code>super</code></td>
</tr>
<tr>
<td style="text-align:left"><code>switch</code></td>
<td style="text-align:left"><code>synchronized</code></td>
<td style="text-align:left"><code>this</code></td>
<td style="text-align:left"><code>throw</code></td>
</tr>
<tr>
<td style="text-align:left"><code>throws</code></td>
<td style="text-align:left"><code>transient</code></td>
<td style="text-align:left"><code>try</code></td>
<td style="text-align:left"><code>void</code></td>
</tr>
<tr>
<td style="text-align:left"><code>volatile</code></td>
<td style="text-align:left"><code>while</code></td>
<td style="text-align:left"></td>
</tr>
</tbody>
</table>
<h3 id="&#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627;">&#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627;</h3>
<p>&#x627;&#x6AF;&#x631; &#x628;&#x627; &#x632;&#x628;&#x627;&#x646;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x62F;&#x6CC;&#x6AF;&#x631; &#x6A9;&#x627;&#x631; &#x6A9;&#x631;&#x62F;&#x647; &#x628;&#x627;&#x634;&#x6CC;&#x62F;&#x60C; &#x62D;&#x62A;&#x645;&#x627; &#x628;&#x627; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x622;&#x634;&#x646;&#x627; &#x647;&#x633;&#x62A;&#x6CC;&#x62F;. &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x62E;&#x637; &#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x6A9;&#x647; &#x62A;&#x648;&#x633;&#x637; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62E;&#x648;&#x627;&#x646;&#x62F;&#x647; &#x646;&#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x648;&#x62C;&#x648;&#x62F; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631;&#x6CC; &#x631;&#x627; &#x62F;&#x631; &#x631;&#x648;&#x646;&#x62F; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x648; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x62D;&#x627;&#x635;&#x644; &#x646;&#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x646;&#x62F;. &#x627;&#x632; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x645;&#x639;&#x645;&#x648;&#x644;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x62F;&#x631;&#x62C; &#x62A;&#x648;&#x636;&#x6CC;&#x62D; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.</p>
<p> &#x645;&#x62B;&#x644;&#x627; &#x627;&#x6AF;&#x631; &#x6A9;&#x62F; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633; &#x62F;&#x6CC;&#x6AF;&#x631;&#x6CC; &#x628;&#x62F;&#x647;&#x6CC;&#x62F;&#x60C; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x6A9;&#x645;&#x6A9; &#x628;&#x633;&#x6CC;&#x627;&#x631; &#x634;&#x627;&#x6CC;&#x627;&#x646;&#x6CC; &#x62F;&#x631; &#x641;&#x647;&#x645;&#x6CC;&#x62F;&#x646; &#x6A9;&#x62F; &#x62A;&#x648;&#x633;&#x637; &#x622;&#x646; &#x641;&#x631;&#x62F; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x62E;&#x648;&#x62F;&#x62A;&#x627;&#x646; &#x646;&#x6CC;&#x632; &#x627;&#x6AF;&#x631; &#x67E;&#x633; &#x627;&#x632; &#x645;&#x62F;&#x62A;&#x6CC; &#x628;&#x647; &#x6A9;&#x62F;&#x62A;&#x627;&#x646; &#x646;&#x6AF;&#x627;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x628;&#x633;&#x6CC;&#x627;&#x631;&#x6CC; &#x627;&#x632; &#x645;&#x646;&#x637;&#x642; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x62A;&#x627;&#x646; &#x631;&#x627; &#x646;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x633;&#x627;&#x62F;&#x6AF;&#x6CC; &#x62F;&#x631;&#x6A9; &#x6A9;&#x646;&#x6CC;&#x62F;! &#x627;&#x645;&#x627; &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x6AF;&#x630;&#x627;&#x631;&#x6CC; &#x62F;&#x631;&#x633;&#x62A; &#x648; &#x628;&#x647; &#x62C;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x645;&#x634;&#x6A9;&#x644;&#x627;&#x62A; &#x67E;&#x6CC;&#x634;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x627;&#x644;&#x628;&#x62A;&#x647; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x635;&#x631;&#x641;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x62A;&#x648;&#x636;&#x6CC;&#x62D;&#x627;&#x62A; &#x646;&#x6CC;&#x633;&#x62A;&#x646;&#x62F; &#x648; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x647;&#x631; &#x645;&#x646;&#x638;&#x648;&#x631;&#x6CC; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x62F;&#x648; &#x646;&#x648;&#x639; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x62F;&#x627;&#x631;&#x6CC;&#x645;:</p>
<p>&#x6F1;. <strong>&#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x62A;&#x6A9; &#x62E;&#x637;&#x6CC;</strong> - &#x641;&#x642;&#x637; &#x6CC;&#x6A9; &#x62E;&#x637; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;.</p>
<p>&#x6F2;. <strong>&#x686;&#x646;&#x62F; &#x62E;&#x637;&#x6CC;</strong> - &#x642;&#x627;&#x62F;&#x631; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x62E;&#x637; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x6A9;&#x646;&#x646;&#x62F;.</p>
<p>&#x646;&#x62D;&#x648;&#x647;&#x200C;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x634;&#x6A9;&#x644; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// &#x627;&#x6CC;&#x646;  &#x6CC;&#x6A9; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x62A;&#x6A9; &#x62E;&#x637;&#x6CC; &#x627;&#x633;&#x62A; !</span>
<span class="hljs-comment">// this is a single-line comment</span>

<span class="hljs-comment">/* this is a mutli-line comment
* this is second line
* this is third line
* &#x648; &#x627;&#x6CC;&#x646; &#x647;&#x645; &#x62E;&#x637; &#x686;&#x647;&#x627;&#x631;&#x645; !
*/</span>
</code></pre>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x6AF;&#x641;&#x62A;&#x645; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x62A;&#x648;&#x633;&#x637; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62E;&#x648;&#x627;&#x646;&#x62F;&#x647; &#x646;&#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x62F;&#x631; &#x646;&#x62A;&#x6CC;&#x62C;&#x647; &#x628;&#x648;&#x62F; &#x648; &#x646;&#x628;&#x648;&#x62F; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62A;&#x627;&#x62B;&#x6CC;&#x631;&#x6CC; &#x62F;&#x631; &#x631;&#x648;&#x646;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x62F;&#x627;&#x631;&#x62F;. &#x67E;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x628;&#x647; &#x647;&#x631; &#x634;&#x6A9;&#x644; &#x648; &#x632;&#x628;&#x627;&#x646;&#x6CC; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F; &#x648; &#x627;&#x632; &#x647;&#x631; &#x6A9;&#x627;&#x631;&#x627;&#x6A9;&#x62A;&#x631;&#x6CC; &#x62F;&#x631;&#x648;&#x646; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x627;&#x645;&#x627; &#x647;&#x645;&#x6CC;&#x634;&#x647; &#x633;&#x639;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x645;&#x646;&#x638;&#x645;&#x60C; &#x648;&#x627;&#x636;&#x62D; &#x648; &#x645;&#x631;&#x628;&#x648;&#x637; &#x628;&#x647; &#x6A9;&#x62F; &#x62E;&#x648;&#x62F; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;&#x60C; &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x648;&#x634;&#x646;&#x200C;&#x62A;&#x631; &#x634;&#x62F;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; hello world &#x631;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x6AF;&#x630;&#x627;&#x631;&#x6CC; &#x634;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// main class</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Hello</span> </span>{
    <span class="hljs-comment">// main method</span>
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span> </span>{
        <span class="hljs-comment">// print Hello World</span>
        System.out.println(<span class="hljs-string">&quot;Hello World&quot;</span>);
    }
}
</code></pre>
<p><strong>&#x645;&#x639;&#x645;&#x648;&#x644;&#x627; &#x642;&#x633;&#x645;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x62F;&#x6CC;&#x647;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x6CC;&#x627;&#x632;&#x6CC; &#x628;&#x647; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x6AF;&#x630;&#x627;&#x631;&#x6CC; &#x646;&#x62F;&#x627;&#x631;&#x646;&#x62F; &#x648; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x642;&#x633;&#x645;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x67E;&#x6CC;&#x686;&#x6CC;&#x62F;&#x647;&#x200C;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x6A9;&#x627;&#x631;&#x628;&#x631;&#x62F; &#x62F;&#x627;&#x631;&#x646;&#x62F; &#x648; &#x645;&#x62B;&#x627;&#x644; &#x628;&#x627;&#x644;&#x627; &#x635;&#x631;&#x641;&#x627; &#x62C;&#x647;&#x62A; &#x645;&#x62B;&#x627;&#x644; &#x632;&#x62F;&#x646; &#x628;&#x648;&#x62F;!</strong></p>
<h3 id="modifiers">&#x627;&#x635;&#x644;&#x627;&#x62D; &#x6A9;&#x646;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; </h3>
<p>&#x645;&#x627;&#x646;&#x646;&#x62F; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x632;&#x628;&#x627;&#x646;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x60C; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x646;&#x6CC;&#x632; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x627;&#x62F;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;&#x60C; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x648; ... &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x6CC;&#x627; &#x627;&#x635;&#x644;&#x627;&#x62D; &#x6A9;&#x646;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x645;&#x6A9;&#x627;&#x646; &#x67E;&#x630;&#x6CC;&#x631; &#x627;&#x633;&#x62A;. &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x62F;&#x648; &#x646;&#x648;&#x639; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x646;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x6A9;&#x647; &#x639;&#x628;&#x627;&#x631;&#x62A;&#x200C;&#x627;&#x646;&#x62F; &#x627;&#x632;:</p>
<p>&#x6F1;. &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; - &#x67E;&#x6CC;&#x634;&#x200C;&#x641;&#x631;&#x636;&#x60C; <code>public</code>&#x60C; <code>protected</code> &#x648; <code>private</code> </p>
<p>&#x6F2;. &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631;&#x62F;&#x647;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x63A;&#x6CC;&#x631;&#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; - <code>final</code>&#x60C; <code>abstract</code> &#x648; <code>strictfp</code> </p>
<h3 id="enum-&#x647;&#x627;">Enum &#x647;&#x627;</h3>
<p>&#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x641;&#x647;&#x648;&#x645; enum &#x6A9;&#x647; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x67E;&#x631;&#x6A9;&#x627;&#x631;&#x628;&#x631;&#x62F; &#x62F;&#x631; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x633;&#x62A;&#x60C; &#x642;&#x627;&#x62F;&#x631; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x628;&#x648;&#x62F; &#x6A9;&#x647; &#x6CC;&#x6A9; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x631;&#x627; &#x628;&#x647; &#x686;&#x646;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x627;&#x632; &#x67E;&#x6CC;&#x634; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x634;&#x62F;&#x647; &#x645;&#x62D;&#x62F;&#x648;&#x62F; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x628;&#x647; &#x627;&#x6CC;&#x646; &#x645;&#x642;&#x627;&#x62F;&#x6CC;&#x631; &#x627;&#x632; &#x67E;&#x6CC;&#x634; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x634;&#x62F;&#x647; &#x627;&#x635;&#x637;&#x644;&#x627;&#x62D;&#x627; enum &#x6AF;&#x641;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;. &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; enum &#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x627;&#x6CC;&#x631;&#x627;&#x62F;&#x627;&#x62A; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x6A9;&#x627;&#x647;&#x634; &#x62F;&#x647;&#x6CC;&#x62F;. </p>
<p>&#x641;&#x631;&#x636; &#x6A9;&#x646;&#x6CC;&#x62F; &#x642;&#x635;&#x62F; &#x62F;&#x627;&#x631;&#x6CC;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x641;&#x631;&#x648;&#x634;&#x6AF;&#x627;&#x647; &#x62E;&#x648;&#x62F;&#x631;&#x648; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x627;&#x6CC; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;&#x61B; &#x627;&#x6CC;&#x646; &#x641;&#x631;&#x648;&#x634;&#x6AF;&#x627;&#x647; &#x641;&#x642;&#x637; &#x62E;&#x648;&#x62F;&#x631;&#x648;&#x647;&#x627;&#x6CC;&#x6CC; &#x627;&#x632; &#x628;&#x631;&#x646;&#x62F; &#x628;&#x646;&#x632;&#x60C; &#x634;&#x648;&#x631;&#x648;&#x644;&#x62A; &#x648; &#x622;&#x626;&#x648;&#x62F;&#x6CC; &#x645;&#x6CC;&#x200C;&#x641;&#x631;&#x648;&#x634;&#x62F;. &#x62D;&#x627;&#x644; &#x634;&#x645;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x628;&#x631;&#x646;&#x62F; &#x631;&#x627; &#x641;&#x642;&#x637; &#x628;&#x647; &#x627;&#x6CC;&#x646; &#x633;&#x647; &#x628;&#x631;&#x646;&#x62F; &#x645;&#x62D;&#x62F;&#x648;&#x62F; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x627;&#x6CC;&#x646; &#x6AF;&#x648;&#x646;&#x647; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x645;&#x637;&#x645;&#x626;&#x646; &#x634;&#x62F; &#x6A9;&#x647; &#x627;&#x645;&#x6A9;&#x627;&#x646; &#x646;&#x62E;&#x648;&#x627;&#x647;&#x62F; &#x62F;&#x627;&#x634;&#x62A; &#x6A9;&#x633;&#x6CC; &#x628;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x628;&#x631;&#x646;&#x62F; &#x631;&#x627; &#x628;&#x647; &#x62C;&#x632; &#x627;&#x6CC;&#x646; &#x633;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x60C; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x62F;. &#x628;&#x647; &#x645;&#x62B;&#x627;&#x644; &#x632;&#x6CC;&#x631; &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// make a class for car shop</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">CarShop</span> </span>{
<span class="hljs-comment">// make an enum to define some predefined values</span>
   <span class="hljs-keyword">enum</span> CarBrandNames{ Benz, Chevrolet, Audi }
   <span class="hljs-comment">// assign predefined values to brand variable</span>
   CarBrandNames brand;
}
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">BrandNameTest</span> </span>{
   <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span> </span>{
   <span class="hljs-comment">// make an object from CarShop class named myCarshop</span>
      CarShop myCarShop = <span class="hljs-keyword">new</span> CarShop();
      <span class="hljs-comment">// Assign Chevrolet Value to brand Variable</span>
      myCarShop.brand = CarShop.CarBrandNames.Chevrolet;
      System.out.println(<span class="hljs-string">&quot;Brand is: &quot;</span> + myCarShop.brand);
   }
}
</code></pre>
<p>&#x628;&#x647;  &#x642;&#x633;&#x645;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x645;&#x631;&#x628;&#x648;&#x637; &#x628;&#x647; enum &#x647;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x62F;&#x631; &#x6A9;&#x627;&#x645;&#x646;&#x62A;&#x200C;&#x647;&#x627; &#x645;&#x634;&#x62E;&#x635; &#x627;&#x633;&#x62A;&#x60C;  &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6CC;&#x6A9; enum &#x628;&#x627; &#x646;&#x627;&#x645; <code>CarBrandNames</code> &#x648; &#x645;&#x642;&#x627;&#x62F;&#x6CC;&#x631; &#x645;&#x634;&#x62E;&#x635; &#x62F;&#x631;&#x648;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x628;&#x647; &#x646;&#x627;&#x645; <code>CarShop</code> &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x622;&#x646; &#x631;&#x627; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; <code>brand</code> &#x627;&#x62E;&#x62A;&#x635;&#x627;&#x635; &#x62F;&#x627;&#x62F;&#x6CC;&#x645;. &#x62D;&#x627;&#x644; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x645;&#x62A;&#x62F; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x60C; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x642;&#x628;&#x644;&#x6CC; &#x62E;&#x648;&#x62F; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x645; &#x648; &#x645;&#x642;&#x62F;&#x627;&#x631; Chevrolet &#x631;&#x627; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; <code>brand</code> &#x627;&#x62E;&#x62A;&#x635;&#x627;&#x635; &#x62F;&#x627;&#x62F;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x622;&#x646; &#x631;&#x627; &#x686;&#x627;&#x67E; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645;. &#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; <code>brand</code> &#x628;&#x647; &#x62C;&#x632; &#x633;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x631; enum&#x60C; &#x647;&#x6CC;&#x686; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x62F;&#x6CC;&#x6AF;&#x631;&#x6CC; &#x631;&#x627; &#x646;&#x645;&#x6CC;&#x200C;&#x67E;&#x630;&#x6CC;&#x631;&#x62F;.</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645; &#x62A;&#x627; &#x634;&#x627;&#x647;&#x62F; &#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x6CC; &#x622;&#x646; &#x628;&#x627;&#x634;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C;  /tmp javac BrandNameTest.java
&#x279C;  /tmp java BrandNameTest 
Brand is: Chevrolet
</code></pre>
<p>&#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631;&#x634; &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x6CC;&#x645; &#x62D;&#x627;&#x635;&#x644; &#x634;&#x62F;.</p>
<p> &#x627;&#x6AF;&#x631; &#x627;&#x632; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x627;&#x644;&#x627; &#x686;&#x6CC;&#x632;&#x6CC; &#x645;&#x62A;&#x648;&#x62C;&#x647; &#x646;&#x634;&#x62F;&#x6CC;&#x62F; &#x62C;&#x627;&#x6CC; &#x646;&#x6AF;&#x631;&#x627;&#x646;&#x6CC; &#x646;&#x6CC;&#x633;&#x62A; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x628;&#x62E;&#x634; &#x635;&#x631;&#x641;&#x627; &#x647;&#x62F;&#x641; &#x628;&#x631; &#x631;&#x648;&#x6CC; <code>enum</code> &#x628;&#x648;&#x62F; &#x648; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x628;&#x633;&#x6CC;&#x627;&#x631;&#x6CC; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x634;&#x62F;&#x647; &#x631;&#x627; &#x635;&#x631;&#x641;&#x627; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645;. &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x622;&#x6CC;&#x646;&#x62F;&#x647; &#x686;&#x6AF;&#x648;&#x646;&#x6AF;&#x6CC; &#x646;&#x648;&#x634;&#x62A;&#x646; &#x648; &#x6A9;&#x627;&#x631;&#x6A9;&#x631;&#x62F; &#x62A;&#x6A9; &#x62A;&#x6A9; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x622;&#x645;&#x648;&#x62E;&#x62A;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="text-editor-or-ide.html" class="navigation navigation-prev " aria-label="Previous page: تکست ادیتور یا آی‌دی‌ای؟">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="classes-and-objects.html" class="navigation navigation-next " aria-label="Next page: کلاس‌ها و اشیاء">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"مسائل ابتدایی جاوا","level":"1.7","depth":1,"next":{"title":"کلاس‌ها و اشیاء","level":"1.8","depth":1,"path":"classes-and-objects.md","ref":"classes-and-objects.md","articles":[]},"previous":{"title":"تکست ادیتور یا آی‌دی‌ای؟","level":"1.6","depth":1,"path":"text-editor-or-ide.md","ref":"text-editor-or-ide.md","articles":[]},"dir":"rtl"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"basic-subjects.md","mtime":"2018-09-09T14:23:31.334Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-09T14:56:11.083Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

