
<!DOCTYPE HTML>
<html lang="" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>کلاس‌ها و اشیاء · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="variables.html" />
    
    
    <link rel="prev" href="basic-subjects.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    بیا جاوا یاد بگیریم
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    مقدمه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    نگاهی اجمالی به جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="install-jdk.html">
            
                <a href="install-jdk.html">
            
                    
                    نصب کیت توسعه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="text-editor-or-ide.html">
            
                <a href="text-editor-or-ide.html">
            
                    
                    تکست ادیتور یا آی‌دی‌ای؟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="basic-subjects.html">
            
                <a href="basic-subjects.html">
            
                    
                    مسائل ابتدایی جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="classes-and-objects.html">
            
                <a href="classes-and-objects.html">
            
                    
                    کلاس‌ها و اشیاء
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    متغیرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="modifiers.html">
            
                <a href="modifiers.html">
            
                    
                    اصلاح کننده‌ها
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >کلاس‌ها و اشیاء</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;-&#x648;-&#x627;&#x634;&#x6CC;&#x627;&#x621;">&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627;&#x621;</h1>
<p>&#x645;&#x647;&#x645;&#x200C;&#x62A;&#x631;&#x6CC;&#x646; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x627;&#x633;&#x62A;. &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x648; &#x639;&#x645;&#x644; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x647;&#x645;&#x648;&#x627;&#x631;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62A;&#x645;&#x6CC;&#x632;&#x60C; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x634;&#x62F;&#x647;&#x200C; &#x648; &#x642;&#x62F;&#x631;&#x62A;&#x200C;&#x645;&#x646;&#x62F;&#x6CC; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x62F;&#x648; &#x645;&#x641;&#x647;&#x648;&#x645; &#x627;&#x635;&#x644;&#x6CC; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F;.</p>
<p>&#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x628;&#x62E;&#x634; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;&#x60C; &#x628;&#x631;&#x627;&#x6CC; &#x639;&#x645;&#x648;&#x645; &#x6A9;&#x627;&#x631;&#x628;&#x631;&#x627;&#x646; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x633;&#x62E;&#x62A; &#x648; &#x67E;&#x6CC;&#x686;&#x6CC;&#x62F;&#x647;&#x200C;&#x627;&#x6CC; &#x645;&#x62D;&#x633;&#x648;&#x628; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x627;&#x62F;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x627;&#x645;&#x644; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62A;&#x648;&#x635;&#x6CC;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F; &#x67E;&#x633; &#x627;&#x632; &#x62E;&#x648;&#x627;&#x646;&#x62F;&#x646; &#x6A9;&#x62A;&#x627;&#x628; &#x62A;&#x645;&#x627;&#x645;&#x6CC; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x622;&#x645;&#x648;&#x62E;&#x62A;&#x6CC;&#x62F; &#x631;&#x627; &#x628;&#x647; &#x62E;&#x648;&#x628;&#x6CC; &#x62A;&#x645;&#x631;&#x6CC;&#x646; &#x6A9;&#x646;&#x6CC;&#x62F; &#x62A;&#x627; &#x628;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x627;&#x635;&#x644;&#x6CC; &#x62A;&#x631;&#x6CC;&#x646; &#x645;&#x633;&#x627;&#x626;&#x644; &#x62C;&#x627;&#x648;&#x627; &#x645;&#x633;&#x644;&#x637; &#x634;&#x648;&#x6CC;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x62A;&#x627; &#x6A9;&#x646;&#x648;&#x646; &#x628;&#x627; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x645;&#x62A;&#x62F; &#x622;&#x634;&#x646;&#x627; &#x646;&#x634;&#x62F;&#x647;&#x200C;&#x627;&#x6CC;&#x62F; &#x648; &#x62A;&#x646;&#x647;&#x627; &#x627;&#x633;&#x645; &#x622;&#x646;&#x200C;&#x631;&#x627; &#x634;&#x646;&#x6CC;&#x62F;&#x647; &#x627;&#x6CC;&#x62F; &#x6A9;&#x647; &#x628;&#x647; &#x627;&#x6CC;&#x646;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x62F;&#x631; &#x628;&#x62E;&#x634;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x639;&#x62F; &#x62D;&#x62A;&#x645;&#x627; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x634;&#x62F;.</p>
<h3 id="classes">&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; </h3>
<p>&#x628;&#x647; &#x637;&#x648;&#x631; &#x62E;&#x644;&#x627;&#x635;&#x647;&#x60C; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x647;&#x200C;&#x627;&#x6CC; &#x627;&#x632; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627; &#x648; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x62F;&#x627;&#x646;&#x633;&#x62A;&#x60C; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x627;&#x634;&#x6CC;&#x627;&#x621; &#x631;&#x627; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x633;&#x627;&#x62E;&#x62A;. &#x62A;&#x645;&#x627;&#x645; &#x627;&#x634;&#x6CC;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC; &#x647;&#x645;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x62F;&#x627;&#x631;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x645;&#x6AF;&#x631; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x631;&#x62E;&#x6CC; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x6A9;&#x647; &#x642;&#x627;&#x628;&#x644; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x647;&#x633;&#x62A;&#x646;&#x62F;&#x60C; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x6CC;&#x62F;.</p>
<h4 id="&#x686;&#x6AF;&#x648;&#x646;&#x647;-&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;-&#x631;&#x627;-&#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645;&#x61F;">&#x686;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645;&#x61F;</h4>
<p>&#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; class &#x631;&#x627; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x646;&#x627;&#x645; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x639;&#x644;&#x627;&#x645;&#x62A; } &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x628;&#x627;&#x632; &#x6A9;&#x631;&#x62F;&#x647; &#x648; &#x67E;&#x633; &#x627;&#x632; &#x627;&#x6CC;&#x646;&#x6A9;&#x647; &#x645;&#x62D;&#x62A;&#x648;&#x6CC;&#x627;&#x62A; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x6CC;&#x62F; &#x644;&#x627;&#x632;&#x645; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x627; &#x639;&#x644;&#x627;&#x645;&#x62A; { &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x62E;&#x627;&#x62A;&#x645;&#x647; &#x62F;&#x647;&#x6CC;&#x62F;.</p>
<p>&#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Name</span> </span>{
<span class="hljs-comment">// class contents</span>
}
</code></pre>
<p>&#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x646;&#x627;&#x645; &#x6AF;&#x630;&#x627;&#x631;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x62D;&#x631;&#x641; &#x627;&#x648;&#x644; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627;&#x6CC;&#x62F; &#x6CC;&#x6A9; &#x62D;&#x631;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x628;&#x627;&#x634;&#x62F;&#x60C; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x627;&#x6AF;&#x631; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x634;&#x645;&#x627; &#x627;&#x632; &#x686;&#x646;&#x62F; &#x6A9;&#x644;&#x645;&#x647; &#x62A;&#x634;&#x6A9;&#x6CC;&#x644; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x628;&#x647;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x62D;&#x631;&#x641; &#x627;&#x648;&#x644; &#x647;&#x631; &#x6A9;&#x644;&#x645;&#x647; &#x628;&#x627; &#x62D;&#x631;&#x648;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x622;&#x63A;&#x627;&#x632; &#x634;&#x648;&#x62F;. &#x645;&#x627;&#x646;&#x646;&#x62F;: MyNewClass</p>
<p>&#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x647;&#x631; &#x6A9;&#x62F;&#x627;&#x645; &#x627;&#x632; &#x627;&#x646;&#x648;&#x627;&#x639; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x62E;&#x648;&#x62F; &#x62C;&#x627;&#x6CC; &#x62F;&#x647;&#x62F;:</p>
<p><strong>&#x6F1;. &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x62D;&#x644;&#x6CC;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631;&#x648;&#x646; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x648; &#x633;&#x627;&#x6CC;&#x631; &#x628;&#x644;&#x648;&#x6A9;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x62F; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;.</p>
<p>&#x6F2;. <strong>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x627;&#x62E;&#x644; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x632; &#x647;&#x631; &#x646;&#x648;&#x639; &#x645;&#x62A;&#x62F;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x648; &#x628;&#x644;&#x648;&#x6A9; &#x6A9;&#x62F; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;.</p>
<p><strong>&#x6F3;. &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631;&#x648;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x632; &#x647;&#x631; &#x645;&#x62A;&#x62F;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>static</code> &#x647;&#x633;&#x62A;&#x646;&#x62F;.</p>
<p>&#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x647;&#x631; &#x62A;&#x639;&#x62F;&#x627;&#x62F; &#x645;&#x62A;&#x62F; &#x631;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x62E;&#x648;&#x62F; &#x62C;&#x627;&#x6CC; &#x62F;&#x647;&#x62F;.</p>
<h3 id="objects">&#x627;&#x634;&#x6CC;&#x627;&#x621; </h3>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x647; &#x628;&#x627;&#x631;&#x647;&#x627; &#x6AF;&#x641;&#x62A;&#x647; &#x634;&#x62F;&#x60C; &#x627;&#x634;&#x6CC;&#x627; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F;:</p>
<p>&#x6F1;. &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. (&#x6A9;&#x647; &#x627;&#x635;&#x637;&#x644;&#x627;&#x62D;&#x627; &#x646;&#x648;&#x639; &#x634;&#x6CC; &#x646;&#x627;&#x645; &#x62F;&#x627;&#x631;&#x62F;)</p>
<p>&#x6F2;. &#x633;&#x67E;&#x633; &#x646;&#x627;&#x645; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631; &#x62E;&#x648;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x634;&#x6CC;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F; &#x631;&#x627; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;</p>
<p>&#x6F3;. &#x67E;&#x633; &#x627;&#x632; &#x622;&#x646; &#x628;&#x627; &#x6CC;&#x6A9; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x645;&#x633;&#x627;&#x648;&#x6CC; (=) &#x648; &#x633;&#x67E;&#x633; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; new&#x60C; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x641;&#x631;&#x627;&#x628;&#x62E;&#x648;&#x627;&#x646;&#x6CC;&#x62F;!</p>
<p><strong>&#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x647;&#x645;&#x648;&#x627;&#x631;&#x647; &#x645;&#x62A;&#x62F;&#x6CC; &#x628;&#x627; &#x646;&#x627;&#x645;&#x6CC; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x631;&#x627;&#x628;&#x631; &#x628;&#x627; &#x646;&#x627;&#x645; &#x647;&#x645;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x633;&#x62A;.</strong></p>
<p>&#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x6A9;&#x631;&#x62F;:</p>
<pre><code class="lang-java">ClassName objectName = <span class="hljs-keyword">new</span> Constructor();
</code></pre>
<h3 id="constructors">&#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; </h3>
<p>&#x648;&#x642;&#x62A;&#x6CC; &#x635;&#x62D;&#x628;&#x62A; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x645;&#x647;&#x645;&#x200C;&#x62A;&#x631;&#x6CC;&#x646; &#x645;&#x633;&#x627;&#x626;&#x644;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x631;&#x62F; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x645;&#x62A;&#x62F; &#x6CC;&#x627; &#x62A;&#x627;&#x628;&#x639; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; (constructor) &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x67E;&#x6CC;&#x634; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x646;&#x6CC;&#x632; &#x627;&#x633;&#x645; &#x622;&#x646; &#x631;&#x627; &#x634;&#x646;&#x6CC;&#x62F;&#x647; &#x627;&#x6CC;&#x62F;. &#x62A;&#x645;&#x627;&#x645;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x62D;&#x62F;&#x627;&#x642;&#x644; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x646;&#x62F; &#x648; &#x62D;&#x62A;&#x6CC; &#x627;&#x6AF;&#x631; &#x622;&#x646; &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x646;&#x6A9;&#x646;&#x6CC;&#x645; &#x646;&#x6CC;&#x632; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x6CC;&#x6A9; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x67E;&#x6CC;&#x634;&#x200C;&#x641;&#x631;&#x636; &#x628;&#x631;&#x627;&#x6CC; &#x622;&#x646; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x62F;.</p>
<p>&#x647;&#x631; &#x628;&#x627;&#x631; &#x6A9;&#x647; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;&#x60C; &#x62D;&#x62F;&#x627;&#x642;&#x644; &#x6CC;&#x6A9; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;. &#x642;&#x627;&#x639;&#x62F;&#x647;&#x200C;&#x6CC; &#x627;&#x635;&#x644;&#x6CC; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x6CC;&#x646; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x627;&#x6CC;&#x62F; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x647;&#x645; &#x646;&#x627;&#x645; &#x628;&#x627; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x628;&#x627;&#x634;&#x646;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x646;&#x6CC;&#x632; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;. &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x645;&#x62B;&#x627;&#x644;&#x6CC; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x627;&#x632; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x647; &#x647;&#x645;&#x631;&#x627;&#x647; &#x62F;&#x648; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">JavaLearn</span> </span>{
JavaLearn(){
<span class="hljs-comment">// first constructor</span>
}
JavaLearn(<span class="hljs-keyword">int</span> myNumber){
<span class="hljs-comment">// second constructor with a parameter, myNumber.</span>
}
}
</code></pre>
<p>&#x646;&#x6A9;&#x62A;&#x647;: &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x62F;&#x648;&#x645; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x648; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x627;&#x632; &#x646;&#x648;&#x639; <code>int</code>&#x628;&#x627; &#x646;&#x627;&#x645; <code>myNumber</code> &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. &#x62F;&#x631; &#x628;&#x62E;&#x634; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x628;&#x627; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x622;&#x634;&#x646;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x634;&#x62F;.</p>
<p><strong>&#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x647;&#x645;&#x648;&#x627;&#x631;&#x647; &#x641;&#x627;&#x642;&#x62F; &#x646;&#x648;&#x639; &#x647;&#x633;&#x62A;&#x646;&#x62F;! &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x62D;&#x62A;&#x6CC; void &#x646;&#x6CC;&#x632; &#x646;&#x6CC;&#x633;&#x62A;&#x646;&#x62F;! &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x647;&#x6CC;&#x686; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x628;&#x631; &#x646;&#x645;&#x6CC;&#x200C;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F;!</strong></p>
<h3 id="access-to-instance-variables-and-class-methods">&#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; &#x648; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; </h3>
<p>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; &#x648; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A; &#x627;&#x634;&#x6CC;&#x627; &#x628;&#x647; &#x633;&#x627;&#x62F;&#x6AF;&#x6CC; &#x62F;&#x631; &#x62F;&#x633;&#x62A;&#x631;&#x633; &#x647;&#x633;&#x62A;&#x646;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x6CC;&#x627; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x646;&#x645;&#x648;&#x646;&#x647; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631;&#x60C; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x646;&#x627;&#x645; &#x634;&#x6CC;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x62F; &#x631;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x648; &#x633;&#x67E;&#x633; &#x628;&#x627; &#x6AF;&#x630;&#x627;&#x634;&#x62A;&#x646; &#x6CC;&#x6A9; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x646;&#x642;&#x637;&#x647; &quot; <strong>.</strong> &quot; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x641;&#x631;&#x627;&#x628;&#x62E;&#x648;&#x627;&#x646;&#x6CC;&#x62F;. &#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x6A9;&#x644;&#x6CC; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x646;&#x6CC;&#x632; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// create an object</span>
ObjectClassName objectName = <span class="hljs-keyword">new</span> Constructor();

<span class="hljs-comment">// call a method</span>
objectName.methodName();

<span class="hljs-comment">// call a variable</span>
objectName.variableName;
</code></pre>
<p>&#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x628;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x628;&#x647; &#x633;&#x637;&#x648;&#x62D; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC;&#x60C; &#x642;&#x627;&#x62F;&#x631; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x628;&#x648;&#x62F; &#x645;&#x642;&#x627;&#x62F;&#x6CC;&#x631; &#x631;&#x627; &#x646;&#x6CC;&#x632; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x6CC;&#x62F;&#x60C; &#x645;&#x62B;&#x644;&#x627;:</p>
<pre><code class="lang-text">objectName.variableName = Value;
</code></pre>
<p>&#x628;&#x633;&#x6CC;&#x627;&#x631; &#x62E;&#x628;! &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x622;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x62D;&#x627;&#x644;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x645;&#x62E;&#x62A;&#x644;&#x641; &#x631;&#x627; &#x645;&#x648;&#x631;&#x62F; &#x628;&#x631;&#x631;&#x633;&#x6CC; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x647;&#x6CC;&#x645;.</p>
<p>&#x6CC;&#x6A9; &#x633;&#x6AF; &#x631;&#x627; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x628;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x62F;. &#x627;&#x6CC;&#x646; &#x633;&#x6AF; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x646;&#x698;&#x627;&#x62F;&#x60C; &#x633;&#x646;&#x60C; &#x631;&#x646;&#x6AF; &#x648; ... &#x62F;&#x627;&#x631;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x633;&#x6AF; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x634;&#x627;&#x645;&#x644; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x63A;&#x630;&#x627; &#x62E;&#x648;&#x631;&#x62F;&#x646;&#x60C; &#x62E;&#x648;&#x627;&#x628;&#x6CC;&#x62F;&#x646;&#x60C; &#x62F;&#x648;&#x6CC;&#x62F;&#x646; &#x648; ... &#x628;&#x627;&#x634;&#x62F;. &#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x647;&#x645;&#x6CC;&#x646; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627; &#x631;&#x627; &#x62F;&#x631; &#x642;&#x627;&#x644;&#x628; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627; &#x639;&#x646;&#x648;&#x627;&#x646; <code>Dog</code> &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x645;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// dog class; you can save it as Dog.java</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Dog</span> </span>{
String color = <span class="hljs-string">&quot;brown&quot;</span>;
String breed = <span class="hljs-string">&quot;bulldog&quot;</span>;
<span class="hljs-keyword">int</span> age = <span class="hljs-number">3</span>;
<span class="hljs-comment">// constructor</span>
Dog(String name){
System.out.println(<span class="hljs-string">&quot;your dog name is: &quot;</span> + name);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">eating</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is eating&quot;</span>);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sleeping</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is sleeping&quot;</span>);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">running</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is running&quot;</span>);
}
}
</code></pre>
<p>&#x62D;&#x627;&#x644;&#x627; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x633;&#x6AF; &#x628;&#x627; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x630;&#x6A9;&#x631; &#x634;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645;. &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x648; &#x631;&#x627;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645;.</p>
<p>&#x627;&#x648;&#x644;&#x6CC;&#x646; &#x631;&#x627;&#x647; &#x646;&#x648;&#x634;&#x62A;&#x646; &#x6A9;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x648; &#x633;&#x67E;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x634;&#x6CC; &#x627;&#x632; &#x622;&#x646; &#x627;&#x633;&#x62A;. &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// Dog Class</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Dog</span> </span>{
String color = <span class="hljs-string">&quot;brown&quot;</span>;
String breed = <span class="hljs-string">&quot;bulldog&quot;</span>;
<span class="hljs-keyword">int</span> age = <span class="hljs-number">3</span>;
<span class="hljs-comment">// constructor</span>
Dog(String name){
System.out.println(<span class="hljs-string">&quot;your dog name is: &quot;</span> + name);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">eating</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is eating&quot;</span>);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sleeping</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is sleeping&quot;</span>);
}
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">running</span><span class="hljs-params">()</span></span>{
System.out.println(<span class="hljs-string">&quot;Dog is running&quot;</span>);
}
}
<span class="hljs-comment">// the main class of program</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyProgram</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
Dog myDog = <span class="hljs-keyword">new</span> Dog(<span class="hljs-string">&quot;Jessie&quot;</span>);
myDog.eating();
myDog.color = <span class="hljs-string">&quot;white&quot;</span>;
myDog.sleeping();
System.out.println(<span class="hljs-string">&quot;my dog&apos;s color is: &quot;</span> + myDog.color);
}
}
</code></pre>
<p>&#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x647;&#x646;&#x6AF;&#x627;&#x645;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x628;&#x647; &#x62C;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x60C; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x6CC;&#x6AF;&#x631; &#x627;&#x636;&#x627;&#x641;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; (&#x645;&#x62B;&#x644; &#x647;&#x645;&#x6CC;&#x646; Dog) &#x646;&#x628;&#x627;&#x6CC;&#x62F; &#x627;&#x632; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>public</code> &#x62F;&#x631;&#x648;&#x646; &#x622;&#x646; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x632;&#x645;&#x627;&#x646;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x627; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>public</code> &#x645;&#x6CC;&#x200C;&#x633;&#x627;&#x632;&#x6CC;&#x62F;&#x60C; &#x628;&#x627;&#x6CC;&#x62F; &#x646;&#x627;&#x645; &#x622;&#x646;&#x60C; &#x628;&#x627; &#x646;&#x627;&#x645; &#x641;&#x627;&#x6CC;&#x644; &#x62C;&#x627;&#x648;&#x627; &#x6CC;&#x6A9;&#x6CC; &#x628;&#x627;&#x634;&#x62F;.</p>
<p>&#x631;&#x627;&#x647; &#x62F;&#x648;&#x645; &#x630;&#x62E;&#x6CC;&#x631;&#x647; &#x6A9;&#x631;&#x62F;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x62C;&#x62F;&#x627;&#x6AF;&#x627;&#x646;&#x647; &#x627;&#x633;&#x62A;. &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x647; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6A9;&#x644;&#x627;&#x633; <code>Dog</code> &#x631;&#x627; &#x631;&#x648;&#x6CC; &#x641;&#x627;&#x6CC;&#x644;&#x6CC; &#x628;&#x647; &#x646;&#x627;&#x645; Dog.java &#x645;&#x6CC;&#x200C;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x641;&#x627;&#x6CC;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x64A; &#x627;&#x635;&#x644;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x647;&#x645;&#x6CC;&#x634;&#x647; &#x648; &#x628;&#x627; &#x631;&#x639;&#x627;&#x6CC;&#x62A; &#x6A9;&#x631;&#x62F;&#x646; &#x642;&#x627;&#x639;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x648; &#x6A9;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x638;&#x6CC;&#x631; &#x633;&#x627;&#x62E;&#x62A; &#x634;&#x6CC; &#x648; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x622;&#x646; &#x631;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x6CC;&#x62F;.</p>
<p>&#x628;&#x627; &#x627;&#x6CC;&#x646; &#x631;&#x648;&#x634; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x634;&#x645;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyProgram</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
Dog myDog = <span class="hljs-keyword">new</span> Dog(<span class="hljs-string">&quot;Jessie&quot;</span>);
myDog.eating();
myDog.color = <span class="hljs-string">&quot;white&quot;</span>;
myDog.sleeping();
System.out.println(<span class="hljs-string">&quot;my dog&apos;s color is: &quot;</span> + myDog.color);
}
}
</code></pre>
<p>&#x648; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x6A9;&#x644;&#x627;&#x633; <code>Dog</code> &#x646;&#x6CC;&#x632; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x62F;&#x631; &#x645;&#x633;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x647; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x633;&#x627;&#x62E;&#x62A;&#x647;&#x200C;&#x627;&#x6CC;&#x62F;&#x60C; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;. &#x648; &#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x6A9;&#x644;&#x627;&#x633; Dog &#x62D;&#x62A;&#x645;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x644;&#x6CC;&#x62F;&#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; public &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;.</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x648; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C; /tmp javac MyProgram.java
&#x279C; /tmp java MyProgram
your dog name is: Jessie
Dog is eating
Dog is sleeping
my dog&apos;s color is: white
</code></pre>
<p>&#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631;&#x634; &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x6CC;&#x645; &#x62D;&#x627;&#x635;&#x644; &#x634;&#x62F;.</p>
<h3 id="&#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC;-&#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC;-this">&#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; this</h3>
<p>&#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>this</code> &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647;&#x60C; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x648; &#x6CC;&#x627; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x622;&#x646; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;. &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>this</code> &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x645; &#x627;&#x634;&#x627;&#x631;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x647; &#x639;&#x646;&#x627;&#x635;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633; (&#x62E;&#x627;&#x631;&#x62C; &#x627;&#x632; &#x647;&#x631; &#x628;&#x644;&#x648;&#x6A9; &#x6A9;&#x62F;&#x6CC;) &#x645;&#x62D;&#x62F;&#x648;&#x62F; &#x6A9;&#x646;&#x6CC;&#x645;. &#x628;&#x631;&#x627;&#x6CC; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x639;&#x646;&#x627;&#x635;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x632; &#x637;&#x631;&#x6CC;&#x642; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>this</code> &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x6A9;&#x647; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>this</code> &#x631;&#x627; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x62F;&#x647; &#x648; &#x67E;&#x633; &#x627;&#x632; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x62F;&#x646; &#x6CC;&#x6A9; &#x646;&#x642;&#x637;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x646;&#x645;&#x648;&#x646;&#x647;&#x60C; &#x645;&#x62A;&#x62F; &#x648; &#x6CC;&#x627; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x635;&#x62F;&#x627; &#x628;&#x632;&#x646;&#x6CC;&#x645;.</p>
<p>&#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x628;&#x627; &#x6CC;&#x6A9; &#x645;&#x62B;&#x627;&#x644; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x631;&#x627; &#x631;&#x648;&#x634;&#x646;&#x200C;&#x62A;&#x631; &#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyAgeClass</span> </span>{
<span class="hljs-keyword">int</span> myAge = <span class="hljs-number">19</span>;
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">showAge</span><span class="hljs-params">(<span class="hljs-keyword">int</span> myAge)</span> </span>{
System.out.println(<span class="hljs-string">&quot;the method&apos;s argument for age is:&#x200C; &quot;</span> + myAge);
System.out.println(<span class="hljs-string">&quot;the age from instance variable is: &quot;</span> + <span class="hljs-keyword">this</span>.myAge);
}
}

<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Age</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span> <span class="hljs-params">(String []args)</span> </span>{
MyAgeClass myAgeObject = <span class="hljs-keyword">new</span> MyAgeClass();
myAgeObject.showAge(<span class="hljs-number">18</span>);
}
}
</code></pre>
<p>&#x62F;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x627;&#x644;&#x627; -</p>
<p>&#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627; &#x646;&#x627;&#x645; <code>MyAgeClass</code> &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x645;.</p>
<p>&#x633;&#x67E;&#x633; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x6CC; &#x628;&#x647; &#x646;&#x627;&#x645; <code>myAge</code> &#x627;&#x632; &#x646;&#x648;&#x639; <code>int</code> &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x645; &#x6A9;&#x647; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x645;&#x642;&#x62F;&#x627;&#x631; <code>19</code> &#x628;&#x648;&#x62F;.</p>
<p>&#x67E;&#x633; &#x627;&#x632; &#x622;&#x646; &#x645;&#x62A;&#x62F;&#x6CC; &#x628;&#x647; &#x646;&#x627;&#x645; <code>showAge</code> &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x645; &#x6A9;&#x647; &#x6CC;&#x6A9; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x627;&#x632; &#x646;&#x648;&#x639; int &#x628;&#x627; &#x646;&#x627;&#x645; <code>myAge</code> &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. &#x646;&#x6A9;&#x62A;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x6CC;&#x646;&#x200C;&#x62C;&#x627; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x627;&#x6CC;&#x646; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x200D;<code>myAge</code> &#x6A9;&#x647; &#x645;&#x62A;&#x62F; <code>showAge</code> &#x622;&#x646; &#x631;&#x627; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x62F;&#x60C; &#x647;&#x6CC;&#x686; &#x627;&#x631;&#x62A;&#x628;&#x627;&#x637;&#x6CC; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x646;&#x645;&#x648;&#x646;&#x647;&#x200C;&#x6CC; <code>myAge</code> &#x646;&#x62F;&#x627;&#x631;&#x62F; &#x648; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x6A9;&#x627;&#x631;&#x628;&#x631;&#x62F; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>this</code> &#x62F;&#x631; &#x647;&#x645;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x627;&#x633;&#x62A;!</p>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x62F;&#x631;&#x648;&#x646; &#x645;&#x62A;&#x62F; <code>showAge</code> &#x62F;&#x648; &#x645;&#x62A;&#x62F; &#x686;&#x627;&#x67E; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x62F;&#x647; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x627;&#x648;&#x644;&#x6CC; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x628;&#x647; &#x62A;&#x627;&#x628;&#x639; <code>showAge</code> &#x62F;&#x627;&#x62F;&#x647; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x631;&#x627; &#x686;&#x627;&#x67E; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x648; &#x62F;&#x648;&#x645;&#x6CC;&#x646; &#x645;&#x62A;&#x62F; &#x646;&#x6CC;&#x632; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x646;&#x645;&#x648;&#x646;&#x647;&#x200C;&#x6CC; <code>myAge</code> &#x631;&#x627; &#x686;&#x627;&#x67E; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;.</p>
<p>&#x62D;&#x627;&#x644; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x645;&#x62A;&#x62F; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; <code>MyAgeClass</code> &#x645;&#x6CC;&#x200C;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x645;&#x62A;&#x62F; <code>showAge</code> &#x631;&#x627; &#x628;&#x627; &#x645;&#x642;&#x62F;&#x627;&#x631; <code>18</code> &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;.</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x648; &#x627;&#x62C;&#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645; &#x62A;&#x627; &#x646;&#x62A;&#x6CC;&#x62C;&#x647; &#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code>&#x279C; /tmp javac Age.java
&#x279C; /tmp java Age
the method&apos;s argument for age is:&#x200C; 18
the age from instance variable is: 19
</code></pre><p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x627;&#x648;&#x644;&#x6CC;&#x646; &#x645;&#x62A;&#x62F; &#x686;&#x627;&#x67E;&#x60C; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x6A9;&#x647; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x628;&#x647; &#x645;&#x62A;&#x62F; showAge &#x62F;&#x627;&#x62F;&#x647; &#x628;&#x648;&#x62F;&#x6CC;&#x645; &#x686;&#x627;&#x67E; &#x6A9;&#x631;&#x62F; &#x648; &#x62F;&#x648;&#x645;&#x6CC;&#x646; &#x645;&#x62A;&#x62F; &#x686;&#x627;&#x67E; &#x646;&#x6CC;&#x632; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x645;&#x62D;&#x644;&#x6CC; myAge &#x631;&#x627; &#x628;&#x647; &#x646;&#x645;&#x627;&#x6CC;&#x634; &#x62F;&#x631; &#x622;&#x648;&#x631;&#x62F;.</p>
<h2 id="&#x648;&#x631;&#x627;&#x62B;&#x62A;">&#x648;&#x631;&#x627;&#x62B;&#x62A;</h2>
<p>&#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x645;&#x647;&#x645; &#x62A;&#x631;&#x6CC;&#x646; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x645;&#x641;&#x647;&#x648;&#x645; &#x648;&#x631;&#x627;&#x62B;&#x62A; &#x627;&#x633;&#x62A;. &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x641;&#x647;&#x648;&#x645; &#x648;&#x631;&#x627;&#x62B;&#x62A;&#x60C; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x62C;&#x632;&#x627;&#x6CC; &#x62F;&#x6CC;&#x6AF;&#x631; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F;. &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x62D;&#x627;&#x644;&#x62A; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x648; &#x627;&#x648;&#x644;&#x6CC;&#x647;&#x60C; &#x6A9;&#x644;&#x627;&#x633; &#x67E;&#x62F;&#x631; &#x6CC;&#x627; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC;(&#x627;&#x635;&#x637;&#x644;&#x627;&#x62D;&#x627; Super Class &#x646;&#x6CC;&#x632; &#x6AF;&#x641;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.) &#x648; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x6A9;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x67E;&#x62F;&#x631; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x634;&#x62F;&#x647;&#x60C; &#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x6CC;&#x627; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; (Sub Class &#x646;&#x6CC;&#x632; &#x6AF;&#x641;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.) &#x646;&#x627;&#x645; &#x62F;&#x627;&#x631;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x62E;&#x62A; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>class</code> &#x648; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x631;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x648; &#x633;&#x67E;&#x633; &#x628;&#x627; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>extends</code> &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x631;&#x627; &#x645;&#x634;&#x62E;&#x635; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x648;&#x631;&#x627;&#x62B;&#x62A; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySuperClass</span> </span>{
<span class="hljs-comment">// class contenets</span>
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySubClass</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MySuperClass</span> </span>{
<span class="hljs-comment">// class contents</span>
}
</code></pre>
<p>&#x62F;&#x631; &#x645;&#x62B;&#x627;&#x644; &#x628;&#x627;&#x644;&#x627; &#x6A9;&#x644;&#x627;&#x633; <code>MySubClass</code> &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x6CC;&#x627; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x628;&#x631;&#x627;&#x6CC; <code>MySuperClass</code> &#x645;&#x62D;&#x633;&#x648;&#x628; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.</p>
<p>&#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x62A;&#x645;&#x627;&#x645; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x631;&#x627; &#x628;&#x647; &#x627;&#x631;&#x62B; &#x645;&#x6CC;&#x200C;&#x628;&#x631;&#x62F; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x628;&#x647; &#x62C;&#x632; &#x62A;&#x639;&#x62F;&#x627;&#x62F;&#x6CC; &#x645;&#x639;&#x62F;&#x648;&#x62F; (&#x6A9;&#x647; &#x62F;&#x631; &#x628;&#x62E;&#x634; &#x627;&#x635;&#x644;&#x627;&#x62D; &#x6A9;&#x646;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x645;&#x62A;&#x648;&#x62C;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x634;&#x62F;.)&#x60C; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x628;&#x647; &#x62A;&#x645;&#x627;&#x645; &#x645;&#x62D;&#x62A;&#x648;&#x6CC;&#x627;&#x62A; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x62F;&#x627;&#x634;&#x62A;.</p>
<p>&#x6A9;&#x62F; &#x632;&#x6CC;&#x631; &#x645;&#x62B;&#x627;&#x644;&#x6CC; &#x627;&#x632; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x648; &#x632;&#x6CC;&#x631; &#x634;&#x627;&#x62E;&#x647; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Calculation</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">int</span> <span class="hljs-title">multiply</span><span class="hljs-params">(<span class="hljs-keyword">int</span> firstNumber, <span class="hljs-keyword">int</span> secondNumber)</span></span>{
<span class="hljs-keyword">return</span> firstNumber * secondNumber;
}
}
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyCalculation</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Calculation</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">int</span> <span class="hljs-title">division</span><span class="hljs-params">(<span class="hljs-keyword">int</span> firstNumber, <span class="hljs-keyword">int</span> secondNumber)</span></span>{
<span class="hljs-keyword">return</span> firstNumber / secondNumber;
}
}

<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Calculate</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
MyCalculation testCalculate = <span class="hljs-keyword">new</span> MyCalculation();
System.out.println(testCalculate.multiply(<span class="hljs-number">4</span>, <span class="hljs-number">5</span>));
System.out.println(testCalculate.division(<span class="hljs-number">20</span>, <span class="hljs-number">4</span>));
}
}
</code></pre>
<p>&#x646;&#x62A;&#x6CC;&#x62C;&#x647;:</p>
<pre><code>&#x279C; /tmp javac Calculate.java
&#x279C; /tmp java Calculate
20
5
</code></pre><p>&#x62F;&#x631; &#x628;&#x62D;&#x62B; &#x648;&#x631;&#x627;&#x62B;&#x62A; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x647; &#x6CC;&#x627;&#x62F; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x6CC;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x646;&#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x627;&#x632; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x6CC;&#x6AF;&#x631; &#x631;&#x627; &#x6AF;&#x633;&#x62A;&#x631;&#x634; (extend) &#x62F;&#x647;&#x62F;! &#x645;&#x62B;&#x644;&#x627; &#x645;&#x62B;&#x627;&#x644; &#x632;&#x6CC;&#x631; &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x67E;&#x630;&#x6CC;&#x631;&#x641;&#x62A;&#x647; &#x646;&#x6CC;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyClass</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Mercedes</span>, <span class="hljs-title">Porsche</span> </span>{
}
</code></pre>
<h3 id="&#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC;-&#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC;-super">&#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; super</h3>
<p>&#x6A9;&#x627;&#x631;&#x628;&#x631;&#x62F; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; super &#x634;&#x628;&#x6CC;&#x647; &#x628;&#x647; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; this &#x627;&#x633;&#x62A; &#x628;&#x627; &#x627;&#x6CC;&#x646; &#x62A;&#x641;&#x627;&#x648;&#x62A; &#x6A9;&#x647; &#x627;&#x639;&#x636;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x631;&#x627; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x62A;&#x641;&#x6A9;&#x6CC;&#x6A9; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x6AF;&#x641;&#x62A; &#x647;&#x631; &#x632;&#x645;&#x627;&#x646; &#x6A9;&#x647; &#x628;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;&#x6CC; &#x641;&#x631;&#x632;&#x646;&#x62F;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x60C; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x648; &#x6CC;&#x627; &#x645;&#x62A;&#x62F;&#x6CC; &#x631;&#x627; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x645; &#x6A9;&#x647; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x646;&#x627;&#x645; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x628;&#x627; &#x646;&#x627;&#x645; &#x6CC;&#x6A9; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x648; &#x6CC;&#x627; &#x645;&#x62A;&#x62F; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x6CC;&#x6A9;&#x6CC; &#x628;&#x627;&#x634;&#x62F;&#x60C; &#x627;&#x632; super &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;. &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x648;&#x634;&#x646;&#x200C;&#x62A;&#x631; &#x634;&#x62F;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x628;&#x647; &#x645;&#x62B;&#x627;&#x644; &#x632;&#x6CC;&#x631; &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySuperClass</span> </span>{
String myString = <span class="hljs-string">&quot;Hello From Super Class!&quot;</span>;
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySubClass</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MySuperClass</span> </span>{
String myString = <span class="hljs-string">&quot;Hello From Sub Class&quot;</span>;
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">showMyString</span><span class="hljs-params">()</span> </span>{
System.out.println(myString);
}
}

<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyInharitance</span></span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
MySubClass mySub = <span class="hljs-keyword">new</span> MySubClass();
mySub.showMyString();
}
}
</code></pre>
<p>&#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x627;&#x644;&#x627; &#x635;&#x631;&#x641;&#x627; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x6CC;&#x6A9; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x647;&#x645;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x6A9;&#x627;&#x631; &#x628;&#x633;&#x6CC;&#x627;&#x631; &#x633;&#x627;&#x62F;&#x647;&#x200C;&#x627;&#x6CC; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x648; &#x645;&#x646;&#x637;&#x642; &#x622;&#x646; &#x6A9;&#x627;&#x645;&#x644;&#x627; &#x648;&#x627;&#x636;&#x62D; &#x627;&#x633;&#x62A;. &#x627;&#x6AF;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x645; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x627;&#x6CC; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x627;&#x6CC;&#x646; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x62F;&#x627;&#x634;&#x62A;:</p>
<pre><code>&#x279C; /tmp javac MyInharitance.java
&#x279C; /tmp java MyInharitance
Hello From Sub Class
</code></pre><p>&#x62F;&#x631; &#x645;&#x62B;&#x627;&#x644; &#x628;&#x627;&#x644;&#x627; &#x62F;&#x648; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x628;&#x627; &#x646;&#x627;&#x645; <code>myString</code> &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x6CC;&#x639;&#x646;&#x6CC; <code>MySuperClass</code> &#x648; &#x62F;&#x648;&#x645;&#x6CC; &#x646;&#x6CC;&#x632; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x6CC;&#x639;&#x646;&#x6CC; <code>MySubClass</code> &#x642;&#x631;&#x627;&#x631; &#x62F;&#x627;&#x631;&#x62F;. &#x62D;&#x627;&#x644; &#x645;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x645;&#x62A;&#x62F; <code>showMyString</code> &#x6A9;&#x647; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x648;&#x627;&#x642;&#x639; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;&#x60C; &#x645;&#x62A;&#x62F; &#x686;&#x627;&#x67E; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645; &#x62A;&#x627; &#x645;&#x642;&#x62F;&#x627;&#x631; <code>myString</code>&#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x645;. &#x62D;&#x627;&#x644; &#x641;&#x631;&#x636; &#x6A9;&#x646;&#x6CC;&#x62F; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; <code>myString</code> &#x648;&#x627;&#x642;&#x639; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; (<code>MySuperClass</code>) &#x646;&#x6CC;&#x627;&#x632; &#x62F;&#x627;&#x631;&#x6CC;&#x62F;. &#x627;&#x6CC;&#x646;&#x62C;&#x627;&#x633;&#x62A; &#x6A9;&#x647; <code>super</code> &#x628;&#x647; &#x6A9;&#x627;&#x631; &#x634;&#x645;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x62F; &#x622;&#x645;&#x62F;!</p>
<p>&#x628;&#x631;&#x627;&#x6CC; &#x631;&#x648;&#x634;&#x646; &#x634;&#x62F;&#x646; &#x642;&#x636;&#x6CC;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x628;&#x647; &#x634;&#x6A9;&#x644; &#x632;&#x6CC;&#x631; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x6CC;&#x645;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySuperClass</span> </span>{
String myString = <span class="hljs-string">&quot;Hello From Super Class!&quot;</span>;
}

<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySubClass</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MySuperClass</span> </span>{
String myString = <span class="hljs-string">&quot;Hello From Sub Class&quot;</span>;
<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">showMyString</span><span class="hljs-params">()</span> </span>{
System.out.println(<span class="hljs-keyword">super</span>.myString);
}
}

<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyInharitance</span></span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
MySubClass mySub = <span class="hljs-keyword">new</span> MySubClass();
mySub.showMyString();
}
}
</code></pre>
<p>&#x62D;&#x627;&#x644; &#x62F;&#x631; &#x645;&#x62A;&#x62F; &#x686;&#x627;&#x67E; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; <code>super</code> &#x631;&#x627; &#x627;&#x636;&#x627;&#x641;&#x647; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645;&#x60C; &#x627;&#x6CC;&#x646; &#x628;&#x647; &#x627;&#x6CC;&#x646; &#x645;&#x639;&#x646;&#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; <code>myString</code> &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x631; &#x62A;&#x627;&#x628;&#x639; &#x67E;&#x62F;&#x631; &#x627;&#x634;&#x627;&#x631;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645;. &#x646;&#x62A;&#x6CC;&#x62C;&#x647; &#x645;&#x637;&#x644;&#x648;&#x628; &#x627;&#x633;&#x62A;:</p>
<pre><code>&#x279C; /tmp javac MyInharitance.java
&#x279C; /tmp java MyInharitance
Hello From Super Class!
</code></pre><p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x648;&#x627;&#x642;&#x639; &#x634;&#x62F;&#x647; &#x62F;&#x631; &#x6A9;&#x644;&#x627;&#x633; &#x67E;&#x62F;&#x631; &#x686;&#x627;&#x67E; &#x634;&#x62F;.</p>
<p>&#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x6A9;&#x627;&#x631;&#x628;&#x631;&#x62F;&#x647;&#x627;&#x6CC; &#x645;&#x647;&#x645; super &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x627;&#x632; &#x62F;&#x627;&#x62E;&#x644; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x627;&#x633;&#x62A;. &#x628;&#x62F;&#x6CC;&#x646; &#x62A;&#x631;&#x62A;&#x6CC;&#x628; &#x6A9;&#x647; &#x647;&#x631; &#x6AF;&#x627;&#x647; &#x62F;&#x631;&#x648;&#x646; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647;&#x60C; &#x645;&#x62A;&#x62F; <code>super()</code> &#x631;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x627;&#x62C;&#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;! &#x628;&#x647; &#x645;&#x62B;&#x627;&#x644; &#x632;&#x6CC;&#x631; &#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyClass</span> </span>{
MyClass() {
System.out.println(<span class="hljs-string">&quot;Hello from super class!&quot;</span>);
}
}
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySecondClass</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">MyClass</span> </span>{
MySecondClass() {
<span class="hljs-keyword">super</span>();
System.out.println(<span class="hljs-string">&quot;Hello From Sub Class!&quot;</span>);
}
}

<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MySuperTest</span> </span>{
<span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
MySecondClass myObject = <span class="hljs-keyword">new</span> MySecondClass();
}
}
</code></pre>
<p>&#x62F;&#x631; &#x6A9;&#x62F; &#x628;&#x627;&#x644;&#x627;&#x60C; &#x628;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x628;&#x647; &#x645;&#x62A;&#x62F; <code>super()</code> &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x648; &#x633;&#x67E;&#x633; &#x633;&#x627;&#x6CC;&#x631; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x632;&#x6CC;&#x631;&#x634;&#x627;&#x62E;&#x647; &#x627;&#x62C;&#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x62D;&#x627;&#x644; &#x627;&#x6AF;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x6A9;&#x646;&#x6CC;&#x645; &#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631;&#x634; &#x631;&#x627; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x62D;&#x627;&#x635;&#x644; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;:</p>
<pre><code>&#x279C; /tmp javac MySuperTest.java
&#x279C; /tmp java MySuperTest
Hello from super class!
Hello From Sub Class!
</code></pre><h3 id="&#x631;&#x627;&#x628;&#x637;&#x647;&#x200C;&#x6CC;-is-a">&#x631;&#x627;&#x628;&#x637;&#x647;&#x200C;&#x6CC; IS-A</h3>
<p>&#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; IS-A &#x646;&#x627;&#x645; &#x6CC;&#x6A9; &#x645;&#x641;&#x647;&#x648;&#x645; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x6CC;&#x627;&#x646; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;&#x60C; &#x627;&#x6CC;&#x646; &#x634;&#x6CC; &#x6CC;&#x6A9; &#x646;&#x648;&#x639; &#x627;&#x632; &#x622;&#x646; &#x634;&#x6CC; &#x627;&#x633;&#x62A;! (this object is a that object) . &#x628;&#x631;&#x627;&#x6CC; &#x631;&#x648;&#x634;&#x646;&#x200C;&#x62A;&#x631; &#x634;&#x62F;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x646;&#x6AF;&#x627;&#x647;&#x6CC; &#x628;&#x647; &#x6A9;&#x62F; &#x632;&#x6CC;&#x631; &#x628;&#x6CC;&#x646;&#x62F;&#x627;&#x632;&#x6CC;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Car</span> </span>{
}
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Mercedes</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Car</span></span>{
}
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Porsche</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">car</span></span>{
}
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Panamera</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Porsche</span> </span>{
}
</code></pre>
<p>&#x62F;&#x631; &#x62A;&#x6A9;&#x647; &#x6A9;&#x62F; &#x628;&#x627;&#x644;&#x627; --</p>
<p><em>&#x6A9;&#x644;&#x627;&#x633; <code>Mercedes</code> &#x6CC;&#x6A9; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; <code>Car</code> &#x627;&#x633;&#x62A;.</em></p>
<p><em>&#x6A9;&#x644;&#x627;&#x633; <code>Porsche</code> &#x646;&#x6CC;&#x632; &#x6CC;&#x6A9; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; <code>Car</code> &#x627;&#x633;&#x62A;.</em></p>
<p><em>&#x6A9;&#x644;&#x627;&#x633; <code>Panamera</code> &#x6CC;&#x6A9; &#x641;&#x631;&#x632;&#x646;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; <code>Porsche</code> &#x645;&#x62D;&#x633;&#x648;&#x628; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.</em></p>
<p><em>&#x6A9;&#x644;&#x627;&#x633; <code>Panamera</code> &#x641;&#x631;&#x632;&#x646;&#x62F; &#x647;&#x631; &#x62F;&#x648; &#x6A9;&#x644;&#x627;&#x633; <code>Car</code> &#x648; <code>Porsche</code> &#x645;&#x62D;&#x633;&#x648;&#x628; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.</em></p>
<p>&#x62D;&#x627;&#x644; &#x627;&#x6AF;&#x631; &#x628;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x628;&#x627; &#x631;&#x627;&#x628;&#x637;&#x647;&#x200C;&#x6CC; IS-A &#x631;&#x648;&#x627;&#x628;&#x637; &#x628;&#x6CC;&#x646; &#x627;&#x6CC;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x645; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x645; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x6CC;&#x646; &#x6A9;&#x627;&#x631; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x6CC;&#x645;:</p>
<p><em>Mercedes IS-A Car</em></p>
<p><em>Porsche IS-A Car</em></p>
<p><em>Panamera IS-A Porsche</em></p>
<p><em>Hence: Porsche IS-A Car as well</em></p>
<h3 id="packages">&#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; </h3>
<p>&#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x6CC;&#x627; &#x67E;&#x6A9;&#x6CC;&#x62C;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627;&#x647;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x6A9;&#x631;&#x62F;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x627;&#x628;&#x637;&#x200C;&#x647;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F;. &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x647;&#x632;&#x627;&#x631;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x631;&#x627;&#x628;&#x637; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;&#x60C; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x631;&#x648; &#x645;&#x631;&#x62A;&#x628; &#x6A9;&#x631;&#x62F;&#x646; &#x648; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x628;&#x647; &#x631;&#x648;&#x646;&#x62F; &#x67E;&#x6CC;&#x634;&#x631;&#x641;&#x62A; &#x67E;&#x631;&#x648;&#x698;&#x647; &#x6A9;&#x645;&#x6A9; &#x634;&#x627;&#x6CC;&#x627;&#x646;&#x6CC; &#x6A9;&#x646;&#x62F; &#x648; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x627;&#x62C;&#x632;&#x627;&#x6CC; &#x633;&#x648;&#x631;&#x633; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x6CC;&#x632; &#x633;&#x627;&#x62F;&#x647;&#x200C;&#x62A;&#x631; &#x628;&#x627;&#x634;&#x62F;. &#x627;&#x6CC;&#x646; &#x6A9;&#x627;&#x631; &#x628;&#x647; &#x6A9;&#x645;&#x6A9; &#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x645;&#x6A9;&#x627;&#x646; &#x67E;&#x630;&#x6CC;&#x631; &#x627;&#x633;&#x62A;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="basic-subjects.html" class="navigation navigation-prev " aria-label="Previous page: مسائل ابتدایی جاوا">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="variables.html" class="navigation navigation-next " aria-label="Next page: متغیرها">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"کلاس‌ها و اشیاء","level":"1.7","depth":1,"next":{"title":"متغیرها","level":"1.8","depth":1,"path":"variables.md","ref":"variables.md","articles":[]},"previous":{"title":"مسائل ابتدایی جاوا","level":"1.6","depth":1,"path":"basic-subjects.md","ref":"basic-subjects.md","articles":[]},"dir":"rtl"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"classes-and-objects.md","mtime":"2018-08-18T03:44:47.317Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-18T05:29:08.631Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

