
<!DOCTYPE HTML>
<html lang="" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>کلاس‌ها و اشیاء · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="variables.html" />
    
    
    <link rel="prev" href="basic-subjects.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    بیا جاوا یاد بگیریم
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    مقدمه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    نگاهی اجمالی به جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="install-jdk.html">
            
                <a href="install-jdk.html">
            
                    
                    نصب کیت توسعه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="text-editor-or-ide.html">
            
                <a href="text-editor-or-ide.html">
            
                    
                    تکست ادیتور یا آی‌دی‌ای؟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="basic-subjects.html">
            
                <a href="basic-subjects.html">
            
                    
                    مسائل ابتدایی جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="classes-and-objects.html">
            
                <a href="classes-and-objects.html">
            
                    
                    کلاس‌ها و اشیاء
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    متغیرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="aslah-knndh-ha-kaml-nshdh.html">
            
                <a href="aslah-knndh-ha-kaml-nshdh.html">
            
                    
                    اصلاح کننده‌ها - کامل نشده
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="mtdha.html">
            
                <a href="mtdha.html">
            
                    
                    متدها - کامل نشده
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >کلاس‌ها و اشیاء</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;-&#x648;-&#x627;&#x634;&#x6CC;&#x627;&#x621;">&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627;&#x621;</h1>
<p>&#x645;&#x647;&#x645;&#x200C;&#x62A;&#x631;&#x6CC;&#x646; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x627;&#x633;&#x62A;. &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x648; &#x639;&#x645;&#x644; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x647;&#x645;&#x648;&#x627;&#x631;&#x647; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62A;&#x645;&#x6CC;&#x632;&#x60C; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x634;&#x62F;&#x647;&#x200C; &#x648; &#x642;&#x62F;&#x631;&#x62A;&#x200C;&#x645;&#x646;&#x62F;&#x6CC; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x62F;&#x648; &#x645;&#x641;&#x647;&#x648;&#x645; &#x627;&#x635;&#x644;&#x6CC; &#x634;&#x6CC; &#x6AF;&#x631;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F;. </p>
<h3 id="classes">&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; </h3>
<p>&#x628;&#x647; &#x637;&#x648;&#x631; &#x62E;&#x644;&#x627;&#x635;&#x647;&#x60C; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x647;&#x200C;&#x627;&#x6CC; &#x627;&#x632; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627; &#x648; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x62F;&#x627;&#x646;&#x633;&#x62A;&#x60C; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x627;&#x634;&#x6CC;&#x627;&#x621; &#x631;&#x627; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x633;&#x627;&#x62E;&#x62A;. &#x62A;&#x645;&#x627;&#x645; &#x627;&#x634;&#x6CC;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC; &#x647;&#x645;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x62F;&#x627;&#x631;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x645;&#x6AF;&#x631; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x631;&#x62E;&#x6CC; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x6A9;&#x647; &#x642;&#x627;&#x628;&#x644; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x647;&#x633;&#x62A;&#x646;&#x62F;&#x60C; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x6CC;&#x62F;.</p>
<h4 id="&#x686;&#x6AF;&#x648;&#x646;&#x647;-&#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;-&#x631;&#x627;-&#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645;&#x61F;">&#x686;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645;&#x61F;</h4>
<p>&#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F;&#x6CC; class &#x631;&#x627; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x646;&#x627;&#x645; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x639;&#x644;&#x627;&#x645;&#x62A; } &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x628;&#x627;&#x632; &#x6A9;&#x631;&#x62F;&#x647; &#x648; &#x67E;&#x633; &#x627;&#x632; &#x627;&#x6CC;&#x646;&#x6A9;&#x647; &#x645;&#x62D;&#x62A;&#x648;&#x6CC;&#x627;&#x62A; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x6CC;&#x62F; &#x644;&#x627;&#x632;&#x645; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x627; &#x639;&#x644;&#x627;&#x645;&#x62A; { &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x62E;&#x627;&#x62A;&#x645;&#x647; &#x62F;&#x647;&#x6CC;&#x62F;.</p>
<p>&#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Name</span> </span>{
    <span class="hljs-comment">// class contents</span>
}
</code></pre>
<p>&#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x646;&#x627;&#x645; &#x6AF;&#x630;&#x627;&#x631;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x62D;&#x631;&#x641; &#x627;&#x648;&#x644; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627;&#x6CC;&#x62F; &#x6CC;&#x6A9; &#x62D;&#x631;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x628;&#x627;&#x634;&#x62F;&#x60C; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x627;&#x6AF;&#x631; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x634;&#x645;&#x627; &#x627;&#x632; &#x686;&#x646;&#x62F; &#x6A9;&#x644;&#x645;&#x647; &#x62A;&#x634;&#x6A9;&#x6CC;&#x644; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A; &#x628;&#x647;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x62D;&#x631;&#x641; &#x627;&#x648;&#x644; &#x647;&#x631; &#x6A9;&#x644;&#x645;&#x647; &#x628;&#x627; &#x62D;&#x631;&#x648;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x622;&#x63A;&#x627;&#x632; &#x634;&#x648;&#x62F;. &#x645;&#x627;&#x646;&#x646;&#x62F;: MyNewClass</p>
<p>&#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x647;&#x631; &#x6A9;&#x62F;&#x627;&#x645; &#x627;&#x632; &#x627;&#x646;&#x648;&#x627;&#x639; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x62E;&#x648;&#x62F; &#x62C;&#x627;&#x6CC; &#x62F;&#x647;&#x62F;:</p>
<p><strong>&#x6F1;. &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x62D;&#x644;&#x6CC;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631;&#x648;&#x646; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x648; &#x633;&#x627;&#x6CC;&#x631; &#x628;&#x644;&#x648;&#x6A9;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x62F; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;.</p>
<p>&#x6F2;. <strong>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x627;&#x62E;&#x644; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x632; &#x647;&#x631; &#x646;&#x648;&#x639; &#x645;&#x62A;&#x62F;&#x60C; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x648; &#x628;&#x644;&#x648;&#x6A9; &#x6A9;&#x62F; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F;.</p>
<p><strong>&#x6F3;. &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;</strong> - &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631;&#x648;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x62E;&#x627;&#x631;&#x62C; &#x627;&#x632; &#x647;&#x631; &#x645;&#x62A;&#x62F;&#x6CC; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>static</code> &#x647;&#x633;&#x62A;&#x646;&#x62F;.</p>
<p>&#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x647;&#x631; &#x62A;&#x639;&#x62F;&#x627;&#x62F; &#x645;&#x62A;&#x62F; &#x648; &#x628;&#x647; &#x647;&#x631; &#x645;&#x646;&#x638;&#x648;&#x631;&#x6CC; &#x631;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x62E;&#x648;&#x62F; &#x62C;&#x627;&#x6CC; &#x62F;&#x647;&#x62F;.</p>
<h3 id="objects">&#x627;&#x634;&#x6CC;&#x627;&#x621; </h3>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x647; &#x628;&#x627;&#x631;&#x647;&#x627; &#x6AF;&#x641;&#x62A;&#x647; &#x634;&#x62F;&#x60C; &#x627;&#x634;&#x6CC;&#x627; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x633;&#x627;&#x62E;&#x62A;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x646;&#x62F; &#x648; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F;:</p>
<p> &#x6F1;. &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x646;&#x627;&#x645; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. (&#x6A9;&#x647; &#x627;&#x635;&#x637;&#x644;&#x627;&#x62D;&#x627; &#x646;&#x648;&#x639; &#x634;&#x6CC; &#x646;&#x627;&#x645; &#x62F;&#x627;&#x631;&#x62F;)</p>
<p>&#x6F2;. &#x633;&#x67E;&#x633; &#x646;&#x627;&#x645; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631; &#x62E;&#x648;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x634;&#x6CC;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F; &#x631;&#x627; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;</p>
<p>&#x6F3;. &#x67E;&#x633; &#x627;&#x632; &#x622;&#x646; &#x628;&#x627; &#x6CC;&#x6A9; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x645;&#x633;&#x627;&#x648;&#x6CC; (=) &#x648; &#x633;&#x67E;&#x633; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; new&#x60C; &#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x641;&#x631;&#x627;&#x628;&#x62E;&#x648;&#x627;&#x646;&#x6CC;&#x62F;!</p>
<p><strong>&#x645;&#x62A;&#x62F; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x647;&#x645;&#x648;&#x627;&#x631;&#x647; &#x645;&#x62A;&#x62F;&#x6CC; &#x628;&#x627; &#x646;&#x627;&#x645;&#x6CC; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x631;&#x627;&#x628;&#x631; &#x628;&#x627; &#x646;&#x627;&#x645; &#x647;&#x645;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x633;&#x62A;.</strong> </p>
<p>&#x62F;&#x631;  &#x627;&#x62F;&#x627;&#x645;&#x647; &#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x6A9;&#x631;&#x62F;:</p>
<pre><code class="lang-java">ClassName objectName = <span class="hljs-keyword">new</span> Constructor();
</code></pre>
<h3 id="constructors">&#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; </h3>
<p>&#x648;&#x642;&#x62A;&#x6CC; &#x635;&#x62D;&#x628;&#x62A; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x627;&#x634;&#x6CC;&#x627; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x645;&#x647;&#x645;&#x200C;&#x62A;&#x631;&#x6CC;&#x646; &#x645;&#x633;&#x627;&#x626;&#x644;&#x6CC; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x631;&#x62F; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x645;&#x62A;&#x62F; &#x6CC;&#x627; &#x62A;&#x627;&#x628;&#x639; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; (constructor) &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x67E;&#x6CC;&#x634; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x646;&#x6CC;&#x632; &#x627;&#x633;&#x645; &#x622;&#x646; &#x631;&#x627; &#x634;&#x646;&#x6CC;&#x62F;&#x647; &#x627;&#x6CC;&#x62F;. &#x62A;&#x645;&#x627;&#x645;&#x6CC; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x62D;&#x62F;&#x627;&#x642;&#x644; &#x6CC;&#x6A9; &#x62A;&#x627;&#x628;&#x639; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x646;&#x62F; &#x648; &#x62D;&#x62A;&#x6CC; &#x627;&#x6AF;&#x631; &#x622;&#x646; &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x646;&#x6A9;&#x646;&#x6CC;&#x645; &#x646;&#x6CC;&#x632; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x6CC;&#x6A9; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x67E;&#x6CC;&#x634;&#x200C;&#x641;&#x631;&#x636; &#x628;&#x631;&#x627;&#x6CC; &#x622;&#x646; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x62F;.</p>
<p>&#x647;&#x631; &#x628;&#x627;&#x631; &#x6A9;&#x647; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;&#x60C; &#x62D;&#x62F;&#x627;&#x642;&#x644; &#x6CC;&#x6A9; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x641;&#x631;&#x627;&#x62E;&#x648;&#x627;&#x646;&#x6CC; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;. &#x642;&#x627;&#x639;&#x62F;&#x647;&#x200C;&#x6CC; &#x627;&#x635;&#x644;&#x6CC; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x6CC;&#x646; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x628;&#x627;&#x6CC;&#x62F; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x647;&#x645; &#x646;&#x627;&#x645; &#x628;&#x627; &#x6A9;&#x644;&#x627;&#x633; &#x62E;&#x648;&#x62F; &#x628;&#x627;&#x634;&#x646;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647; &#x646;&#x6CC;&#x632; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;. &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x645;&#x62B;&#x627;&#x644;&#x6CC; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x627;&#x632; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x647; &#x647;&#x645;&#x631;&#x627;&#x647; &#x62F;&#x648; &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">JavaLearn</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">JavaLearn</span><span class="hljs-params">()</span></span>{
        <span class="hljs-comment">// first constructor</span>
    }
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">JavaLearn</span><span class="hljs-params">(<span class="hljs-keyword">int</span> myNumber)</span></span>{
        <span class="hljs-comment">// second constructor with a parameter, myNumber.</span>
    }
}
</code></pre>
<p>&#x646;&#x6A9;&#x62A;&#x647;: &#x633;&#x627;&#x632;&#x646;&#x62F;&#x647;&#x200C;&#x6CC; &#x62F;&#x648;&#x645; &#x62F;&#x627;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x648; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x627;&#x632; &#x646;&#x648;&#x639; <code>int</code>&#x628;&#x627; &#x646;&#x627;&#x645; <code>myNumber</code> &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x67E;&#x627;&#x631;&#x627;&#x645;&#x62A;&#x631; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;. &#x62F;&#x631; &#x628;&#x62E;&#x634; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x628;&#x627; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x622;&#x634;&#x646;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x634;&#x62F;.</p>
<h3 id="access-to-instance-variables-and-class-methods">&#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; &#x648; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; </h3>
<p>&#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x645;&#x648;&#x646;&#x647; &#x648; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A; &#x627;&#x634;&#x6CC;&#x627; &#x628;&#x647; &#x633;&#x627;&#x62F;&#x6AF;&#x6CC; &#x62F;&#x631; &#x62F;&#x633;&#x62A;&#x631;&#x633; &#x647;&#x633;&#x62A;&#x646;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x6CC;&#x627; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x646;&#x645;&#x648;&#x646;&#x647; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633;&#x60C; &#x67E;&#x633; &#x627;&#x632; &#x633;&#x627;&#x62E;&#x62A;&#x646; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631;&#x60C; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x646;&#x627;&#x645; &#x634;&#x6CC;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x633;&#x627;&#x62E;&#x62A;&#x6CC;&#x62F; &#x631;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x648; &#x633;&#x67E;&#x633; &#x628;&#x627; &#x6AF;&#x630;&#x627;&#x634;&#x62A;&#x646; &#x6CC;&#x6A9; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x646;&#x642;&#x637;&#x647; &quot; <strong>.</strong> &quot; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x641;&#x631;&#x627;&#x628;&#x62E;&#x648;&#x627;&#x646;&#x6CC;&#x62F;. &#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x6A9;&#x644;&#x6CC; &#x627;&#x6CC;&#x646; &#x645;&#x648;&#x636;&#x648;&#x639; &#x646;&#x6CC;&#x632; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// create an object</span>
ObjectClassName objectName = <span class="hljs-keyword">new</span> Constructor();

<span class="hljs-comment">// call a method</span>
objectName.methodName();

<span class="hljs-comment">// call a variable</span>
objectName.variableName;
</code></pre>
<p>&#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x628;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x628;&#x647; &#x633;&#x637;&#x648;&#x62D; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC;&#x60C; &#x642;&#x627;&#x62F;&#x631; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x628;&#x648;&#x62F; &#x645;&#x642;&#x627;&#x62F;&#x6CC;&#x631; &#x631;&#x627; &#x646;&#x6CC;&#x632; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x6CC;&#x62F;&#x60C; &#x645;&#x62B;&#x644;&#x627;:</p>
<pre><code class="lang-text">objectName.variableName = Value;
</code></pre>
<p>&#x628;&#x633;&#x6CC;&#x627;&#x631; &#x62E;&#x628;! &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x633;&#x67E;&#x633; &#x6CC;&#x6A9; &#x634;&#x6CC; &#x627;&#x632; &#x631;&#x648;&#x6CC; &#x622;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x62D;&#x627;&#x644;&#x62A;&#x200C;&#x647;&#x627;&#x6CC; &#x645;&#x62E;&#x62A;&#x644;&#x641; &#x631;&#x627; &#x645;&#x648;&#x631;&#x62F; &#x628;&#x631;&#x631;&#x633;&#x6CC; &#x642;&#x631;&#x627;&#x631; &#x62F;&#x647;&#x6CC;&#x645;.</p>
<p> &#x6CC;&#x6A9; &#x633;&#x6AF; &#x631;&#x627; &#x62F;&#x631; &#x646;&#x638;&#x631; &#x628;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x62F;. &#x627;&#x6CC;&#x646; &#x633;&#x6AF; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x646;&#x698;&#x627;&#x62F;&#x60C; &#x633;&#x646;&#x60C; &#x631;&#x646;&#x6AF; &#x648; ... &#x62F;&#x627;&#x631;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x6CC;&#x6A9; &#x633;&#x6AF; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x634;&#x627;&#x645;&#x644; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x647;&#x645;&#x686;&#x648;&#x646; &#x63A;&#x630;&#x627; &#x62E;&#x648;&#x631;&#x62F;&#x646;&#x60C; &#x62E;&#x648;&#x627;&#x628;&#x6CC;&#x62F;&#x646;&#x60C; &#x62F;&#x648;&#x6CC;&#x62F;&#x646; &#x648; ... &#x628;&#x627;&#x634;&#x62F;. &#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x647;&#x645;&#x6CC;&#x646; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627; &#x631;&#x627; &#x62F;&#x631; &#x642;&#x627;&#x644;&#x628; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627; &#x639;&#x646;&#x648;&#x627;&#x646; <code>Dog</code> &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x645;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Dog</span> </span>{
    String color = <span class="hljs-string">&quot;brown&quot;</span>;
    String breed = <span class="hljs-string">&quot;bulldog&quot;</span>;
    <span class="hljs-keyword">int</span> age = <span class="hljs-number">3</span>;
    <span class="hljs-comment">// constructor</span>
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">Dog</span><span class="hljs-params">(String name)</span></span>{
        System.out.println(<span class="hljs-string">&quot;your dog name is: &quot;</span> + name);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">eating</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is eating&quot;</span>);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sleeping</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is sleeping&quot;</span>);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">running</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is running&quot;</span>);
    } 
}
</code></pre>
<p>&#x62D;&#x627;&#x644;&#x627; &#x6A9;&#x644;&#x627;&#x633;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x6CC;&#x6A9; &#x633;&#x6AF; &#x628;&#x627; &#x648;&#x6CC;&#x698;&#x6AF;&#x6CC;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x641;&#x62A;&#x627;&#x631;&#x647;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x647; &#x630;&#x6A9;&#x631; &#x634;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645;. &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x648; &#x631;&#x627;&#x647; &#x62F;&#x627;&#x631;&#x6CC;&#x645;.</p>
<p> &#x627;&#x648;&#x644;&#x6CC;&#x646; &#x631;&#x627;&#x647; &#x646;&#x648;&#x634;&#x62A;&#x646; &#x6A9;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x631; &#x62F;&#x627;&#x62E;&#x644; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x627;&#x633;&#x62A; &#x648; &#x633;&#x67E;&#x633; &#x633;&#x627;&#x62E;&#x62A; &#x634;&#x6CC; &#x627;&#x632; &#x622;&#x646; &#x627;&#x633;&#x62A;. &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-comment">// Dog Class</span>
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Dog</span> </span>{
    String color = <span class="hljs-string">&quot;brown&quot;</span>;
    String breed = <span class="hljs-string">&quot;bulldog&quot;</span>;
    <span class="hljs-keyword">int</span> age = <span class="hljs-number">3</span>;
    <span class="hljs-comment">// constructor</span>
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">Dog</span><span class="hljs-params">(String name)</span></span>{
        Syetem.out.println(<span class="hljs-string">&quot;your dog name is: &quot;</span> + name);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">eating</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is eating&quot;</span>);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">sleeping</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is sleeping&quot;</span>);
    }
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">running</span><span class="hljs-params">()</span></span>{
        System.out.println(<span class="hljs-string">&quot;Dog is running&quot;</span>);
    } 
}
<span class="hljs-comment">// the main class of program</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyProgram</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
        Dog myDog = <span class="hljs-keyword">new</span> Dog(<span class="hljs-string">&quot;Jessie&quot;</span>);
        myDog.eating();
        myDog.color = <span class="hljs-string">&quot;white&quot;</span>;
        myDog.sleeping();
        System.out.println(<span class="hljs-string">&quot;my dog&apos;s color is: &quot;</span> + myDog.color);
    }
}
</code></pre>
<p>&#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x647;&#x646;&#x6AF;&#x627;&#x645;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x628;&#x647; &#x62C;&#x632; &#x6A9;&#x644;&#x627;&#x633; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x60C; &#x6CC;&#x6A9; &#x6A9;&#x644;&#x627;&#x633; &#x62F;&#x6CC;&#x6AF;&#x631; &#x627;&#x636;&#x627;&#x641;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; (&#x645;&#x62B;&#x644; &#x647;&#x645;&#x6CC;&#x646; Dog) &#x646;&#x628;&#x627;&#x6CC;&#x62F; &#x627;&#x632; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; public &#x62F;&#x631;&#x648;&#x646; &#x622;&#x646; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x631;&#x627;&#x647; &#x62F;&#x648;&#x645; &#x630;&#x62E;&#x6CC;&#x631;&#x647; &#x6A9;&#x631;&#x62F;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x62C;&#x62F;&#x627;&#x6AF;&#x627;&#x646;&#x647; &#x627;&#x633;&#x62A;. &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x647; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6A9;&#x644;&#x627;&#x633; `Dog` &#x631;&#x627; &#x631;&#x648;&#x6CC; &#x641;&#x627;&#x6CC;&#x644;&#x6CC; &#x628;&#x647; &#x646;&#x627;&#x645; Dog.java &#x645;&#x6CC;&#x200C;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x641;&#x627;&#x6CC;&#x644; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x64A; &#x627;&#x635;&#x644;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x647;&#x645;&#x6CC;&#x634;&#x647; &#x648; &#x628;&#x627; &#x631;&#x639;&#x627;&#x6CC;&#x62A; &#x6A9;&#x631;&#x62F;&#x646; &#x642;&#x627;&#x639;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x648; &#x6A9;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x646;&#x638;&#x6CC;&#x631; &#x633;&#x627;&#x62E;&#x62A; &#x634;&#x6CC; &#x648; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x622;&#x646; &#x631;&#x627; &#x62F;&#x631;&#x648;&#x646; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x6CC;&#x62F;.</p>
<p>&#x628;&#x627; &#x627;&#x6CC;&#x646; &#x631;&#x648;&#x634; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x634;&#x645;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x62F;:</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">MyProgram</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String []args)</span></span>{
        Dog myDog = <span class="hljs-keyword">new</span> Dog(<span class="hljs-string">&quot;Jessie&quot;</span>);
        myDog.eating();
        myDog.color = <span class="hljs-string">&quot;white&quot;</span>;
        myDog.sleeping();
        System.out.println(<span class="hljs-string">&quot;my dog&apos;s color is: &quot;</span> + myDog.color);
    }
}
</code></pre>
<p>&#x648; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646;  &#x641;&#x627;&#x6CC;&#x644; &#x6A9;&#x644;&#x627;&#x633; `Dog` &#x646;&#x6CC;&#x632; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x62F;&#x631; &#x645;&#x633;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x647; &#x641;&#x627;&#x6CC;&#x644; &#x627;&#x635;&#x644;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x633;&#x627;&#x62E;&#x62A;&#x647;&#x200C;&#x627;&#x6CC;&#x62F;&#x60C; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;. &#x648;  &#x62F;&#x642;&#x62A; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x6A9;&#x644;&#x627;&#x633; Dog &#x62D;&#x62A;&#x645;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x644;&#x6CC;&#x62F;&#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; public &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x62F;.</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x6CC;&#x627;&#x6CC;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644; &#x648; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645;:</p>
<pre><code class="lang-text">&#x279C;  /tmp javac MyProgram.java 
&#x279C;  /tmp java MyProgram 
your dog name is: Jessie
Dog is eating
Dog is sleeping
my dog&apos;s color is: white
</code></pre>
<p>&#x646;&#x62A;&#x6CC;&#x62C;&#x647;&#x200C;&#x627;&#x6CC; &#x6A9;&#x647; &#x627;&#x646;&#x62A;&#x638;&#x627;&#x631;&#x634; &#x631;&#x627; &#x62F;&#x627;&#x634;&#x62A;&#x6CC;&#x645; &#x62D;&#x627;&#x635;&#x644; &#x634;&#x62F;.</p>
<h3 id="packages">&#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; </h3>
<p>&#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x6CC;&#x627; &#x67E;&#x6A9;&#x6CC;&#x62C;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627;&#x647;&#x6CC; &#x628;&#x631;&#x627;&#x6CC; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x6A9;&#x631;&#x62F;&#x646; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627; &#x648; &#x631;&#x627;&#x628;&#x637;&#x200C;&#x647;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F;. &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x645;&#x645;&#x6A9;&#x646; &#x627;&#x633;&#x62A; &#x647;&#x632;&#x627;&#x631;&#x627;&#x646; &#x6A9;&#x644;&#x627;&#x633; &#x648; &#x631;&#x627;&#x628;&#x637; &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;&#x60C; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x631;&#x648; &#x645;&#x631;&#x62A;&#x628; &#x6A9;&#x631;&#x62F;&#x646; &#x648; &#x633;&#x627;&#x632;&#x645;&#x627;&#x646;&#x62F;&#x647;&#x6CC; &#x6A9;&#x631;&#x62F;&#x646; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x628;&#x647; &#x631;&#x648;&#x646;&#x62F; &#x67E;&#x6CC;&#x634;&#x631;&#x641;&#x62A; &#x67E;&#x631;&#x648;&#x698;&#x647; &#x6A9;&#x645;&#x6A9; &#x634;&#x627;&#x6CC;&#x627;&#x646;&#x6CC; &#x6A9;&#x646;&#x62F; &#x648; &#x62F;&#x633;&#x62A;&#x631;&#x633;&#x6CC; &#x628;&#x647; &#x627;&#x62C;&#x632;&#x627;&#x6CC; &#x633;&#x648;&#x631;&#x633; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x6CC;&#x632; &#x633;&#x627;&#x62F;&#x647;&#x200C;&#x62A;&#x631; &#x628;&#x627;&#x634;&#x62F;. &#x627;&#x6CC;&#x646; &#x6A9;&#x627;&#x631; &#x628;&#x647; &#x6A9;&#x645;&#x6A9; &#x628;&#x633;&#x62A;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x645;&#x6A9;&#x627;&#x646; &#x67E;&#x630;&#x6CC;&#x631; &#x627;&#x633;&#x62A;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="basic-subjects.html" class="navigation navigation-prev " aria-label="Previous page: مسائل ابتدایی جاوا">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="variables.html" class="navigation navigation-next " aria-label="Next page: متغیرها">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"کلاس‌ها و اشیاء","level":"1.7","depth":1,"next":{"title":"متغیرها","level":"1.8","depth":1,"path":"variables.md","ref":"variables.md","articles":[]},"previous":{"title":"مسائل ابتدایی جاوا","level":"1.6","depth":1,"path":"basic-subjects.md","ref":"basic-subjects.md","articles":[]},"dir":"rtl"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"classes-and-objects.md","mtime":"2018-08-14T13:16:23.813Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-14T14:36:40.888Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

