
<!DOCTYPE HTML>
<html lang="" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>نصب کیت توسعه · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="text-editor-or-ide.html" />
    
    
    <link rel="prev" href="overview.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    بیا جاوا یاد بگیریم
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    مقدمه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    نگاهی اجمالی به جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="install-jdk.html">
            
                <a href="install-jdk.html">
            
                    
                    نصب کیت توسعه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="text-editor-or-ide.html">
            
                <a href="text-editor-or-ide.html">
            
                    
                    تکست ادیتور یا آی‌دی‌ای؟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="basic-subjects.html">
            
                <a href="basic-subjects.html">
            
                    
                    مسائل ابتدایی جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="classes-and-objects.html">
            
                <a href="classes-and-objects.html">
            
                    
                    کلاس‌ها و اشیاء
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    متغیرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="aslah-knndh-ha-kaml-nshdh.html">
            
                <a href="aslah-knndh-ha-kaml-nshdh.html">
            
                    
                    اصلاح کننده‌ها - کامل نشده
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="mtdha.html">
            
                <a href="mtdha.html">
            
                    
                    متدها - کامل نشده
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >نصب کیت توسعه</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x646;&#x635;&#x628;-&#x6A9;&#x6CC;&#x62A;-&#x62A;&#x648;&#x633;&#x639;&#x647;">&#x646;&#x635;&#x628; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;</h1>
<h3 id="what-is-jdk">&#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x686;&#x6CC;&#x633;&#x62A;&#x61F; </h3>
<p>&#x628;&#x631;&#x627;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x632;&#x628;&#x627;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x622;&#x646; &#x631;&#x627; &#x645;&#x62A;&#x646;&#x627;&#x633;&#x628; &#x628;&#x627; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644; &#x62E;&#x648;&#x62F; &#x646;&#x635;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x634;&#x627;&#x645;&#x644; &#x627;&#x628;&#x632;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x628;&#x633;&#x6CC;&#x627;&#x631; &#x632;&#x6CC;&#x627;&#x62F;&#x6CC; &#x62F;&#x631; &#x62C;&#x647;&#x62A; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x648; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627; &#x628;&#x647; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x628;&#x647; &#x686;&#x646;&#x62F; &#x645;&#x648;&#x631;&#x62F; &#x627;&#x632; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x627;&#x634;&#x627;&#x631;&#x647; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x6A9;&#x631;&#x62F;:</p>
<p><strong>&#x62C;&#x627;&#x648;&#x627;</strong> - &#x627;&#x628;&#x632;&#x627;&#x631; &#x645;&#x641;&#x633;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x6A9;&#x647; &#x642;&#x627;&#x62F;&#x631; &#x628;&#x647; &#x62A;&#x641;&#x633;&#x6CC;&#x631; &#x648; &#x62A;&#x648;&#x644;&#x6CC;&#x62F; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x644;&#x627;&#x633; &#x628;&#x627; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x627;&#x632; &#x645;&#x62A;&#x631;&#x62C;&#x645; javac &#x648; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627; &#x627;&#x633;&#x62A;.</p>
<p><strong>&#x62C;&#x627;&#x648;&#x627;&#x633;&#x6CC;</strong> - &#x6A9;&#x627;&#x645;&#x67E;&#x627;&#x6CC;&#x644;&#x631; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x6A9;&#x647; &#x648;&#x638;&#x6CC;&#x641;&#x647;&#x200C;&#x6CC; &#x62A;&#x631;&#x62C;&#x645;&#x647;&#x200C;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x646;&#x648;&#x634;&#x62A;&#x647; &#x634;&#x62F;&#x647; (&#x645;&#x62A;&#x646;) &#x628;&#x647; &#x628;&#x627;&#x6CC;&#x62A;&#x200C;&#x6A9;&#x62F; &#x631;&#x627; &#x628;&#x631; &#x639;&#x647;&#x62F;&#x647; &#x62F;&#x627;&#x631;&#x62F; &#x62A;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631; &#x628;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x634;&#x645;&#x627; &#x631;&#x627; &#x628;&#x62E;&#x648;&#x627;&#x646;&#x62F; &#x648; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x62F;!</p>
<p><strong>&#x627;&#x628;&#x632;&#x627;&#x631; &#x645;&#x633;&#x62A;&#x646;&#x62F;&#x633;&#x627;&#x632;&#x6CC; &#x62C;&#x627;&#x648;&#x627;</strong> - &#x627;&#x6CC;&#x646; &#x627;&#x628;&#x632;&#x627;&#x631; &#x628;&#x647; &#x637;&#x648;&#x631; &#x62E;&#x648;&#x62F;&#x6A9;&#x627;&#x631; &#x645;&#x633;&#x62A;&#x646;&#x62F;&#x627;&#x62A; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x631;&#x627; &#x627;&#x632; &#x645;&#x62A;&#x646; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x6A9;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x627;&#x645;&#x646;&#x62A; &#x645;&#x634;&#x62E;&#x635; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645;&#x60C; &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F;.</p>
<p><strong>&#x62C;&#x627;&#x631;</strong> - &#x6CC;&#x6A9; &#x622;&#x631;&#x634;&#x6CC;&#x648; &#x6A9;&#x646;&#x646;&#x62F;&#x647; &#x6A9;&#x647; &#x6A9;&#x644;&#x627;&#x633;&#x200C;&#x647;&#x627;&#x6CC; &#x6A9;&#x62A;&#x627;&#x628;&#x62E;&#x627;&#x646;&#x647;&#x200C;&#x627;&#x6CC; &#x631;&#x627; &#x62F;&#x631; &#x6CC;&#x6A9; &#x641;&#x627;&#x6CC;&#x644; &#x645;&#x62C;&#x62A;&#x645;&#x639; &#x645;&#x6CC;&#x200C;&#x633;&#x627;&#x632;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x627;&#x632; &#x627;&#x6CC;&#x646; &#x627;&#x628;&#x632;&#x627;&#x631; &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62F;&#x6CC;&#x631;&#x6CC;&#x62A; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x62C;&#x627;&#x631; &#x646;&#x6CC;&#x632; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;.</p>
<p><strong>&#x62C;&#x6CC;&#x200C;&#x62F;&#x6CC;&#x200C;&#x628;&#x6CC;</strong> - &#x6CC;&#x6A9; &#x627;&#x628;&#x632;&#x627;&#x631; &#x62F;&#x628;&#x6CC;&#x627;&#x6AF;&#x631; &#x628;&#x647; &#x645;&#x646;&#x638;&#x648;&#x631; &#x62E;&#x637;&#x627;&#x6CC;&#x627;&#x628;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x633;&#x62A;.</p>
<p>&#x627;&#x6CC;&#x646;&#x200C;&#x647;&#x627; &#x62A;&#x646;&#x647;&#x627; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x645;&#x648;&#x631;&#x62F; &#x627;&#x632; &#x627;&#x628;&#x632;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x631; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x648; &#x628;&#x627; &#x646;&#x635;&#x628; &#x627;&#x6CC;&#x646; &#x6A9;&#x6CC;&#x62A; &#x628;&#x647; &#x627;&#x628;&#x632;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x628;&#x6CC;&#x634;&#x62A;&#x631;&#x6CC; &#x646;&#x6CC;&#x632; &#x62F;&#x633;&#x62A; &#x67E;&#x6CC;&#x62F;&#x627; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x6A9;&#x631;&#x62F;&#x60C; &#x6A9;&#x647; &#x62F;&#x631; &#x635;&#x648;&#x631;&#x62A; &#x646;&#x6CC;&#x627;&#x632; &#x62F;&#x631; &#x645;&#x631;&#x627;&#x62D;&#x644; &#x622;&#x645;&#x648;&#x632;&#x634;&#x60C; &#x628;&#x647; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x646;&#x6CC;&#x632; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;.</p>
<h3 id="how-to-install-jdk">&#x686;&#x6AF;&#x648;&#x646;&#x647; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x646;&#x635;&#x628; &#x6A9;&#x646;&#x6CC;&#x645;&#x61F; </h3>
<p>&#x641;&#x631;&#x622;&#x6CC;&#x646;&#x62F; &#x646;&#x635;&#x628; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x633;&#x62A;&#x647; &#x628;&#x647; &#x646;&#x648;&#x639; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644;&#x6CC; &#x6A9;&#x647; &#x627;&#x632; &#x622;&#x646; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x62F; &#x6A9;&#x645;&#x6CC; &#x645;&#x62A;&#x641;&#x627;&#x648;&#x62A; &#x628;&#x627;&#x634;&#x62F;. &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647; &#x628;&#x647; &#x686;&#x6AF;&#x648;&#x646;&#x6AF;&#x6CC; &#x646;&#x635;&#x628; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x62F;&#x631; &#x633;&#x647; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644; &#x648;&#x6CC;&#x646;&#x62F;&#x648;&#x632;&#x60C; &#x645;&#x6A9;&#x6CC;&#x646;&#x62A;&#x627;&#x634; &#x648; &#x6AF;&#x646;&#x648;/&#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633; &#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x645; &#x67E;&#x631;&#x62F;&#x627;&#x62E;&#x62A;.</p>
<h4 id="&#x648;&#x6CC;&#x646;&#x62F;&#x648;&#x632;">&#x648;&#x6CC;&#x646;&#x62F;&#x648;&#x632;</h4>
<p>&#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x647; <a href="http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html" target="_blank">&#x627;&#x6CC;&#x646; &#x644;&#x6CC;&#x646;&#x6A9;</a> &#x628;&#x631;&#x648;&#x6CC;&#x62F; &#x648; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; &#x645;&#x62E;&#x635;&#x648;&#x635; &#x645;&#x639;&#x645;&#x627;&#x631;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x627;&#x631;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x62F;. (&#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631;&#x647;&#x627;&#x6CC; 32 &#x628;&#x6CC;&#x62A;&#x6CC; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; x86 &#x648; &#x628;&#x631;&#x627;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631;&#x647;&#x627;&#x6CC; 64 &#x628;&#x6CC;&#x62A;&#x6CC; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; x64 &#x631;&#x627; &#x628;&#x627;&#x631;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x646;&#x645;&#x627;&#x6CC;&#x6CC;&#x62F;.)</p>
<p>&#x641;&#x627;&#x6CC;&#x644; &#x627;&#x62C;&#x631;&#x627;&#x6CC;&#x6CC; &#x628;&#x627;&#x631;&#x6AF;&#x6CC;&#x631;&#x6CC; &#x634;&#x62F;&#x647; &#x631;&#x627; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x631;&#x648;&#x646;&#x62F; &#x646;&#x635;&#x628; &#x62A;&#x645;&#x627;&#x645; &#x646;&#x631;&#x645; &#x627;&#x641;&#x632;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x639;&#x627;&#x62F;&#x6CC; &#x67E;&#x6CC;&#x634; &#x628;&#x631;&#x648;&#x6CC;&#x62F; &#x648; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x646;&#x635;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;. (&#x62F;&#x631; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x646;&#x635;&#x628; &#x6A9;&#x631;&#x62F;&#x646; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x60C; &#x628;&#x647; &#x645;&#x633;&#x6CC;&#x631; &#x646;&#x635;&#x628; &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x622;&#x646; &#x631;&#x627; &#x628;&#x647; &#x62E;&#x627;&#x637;&#x631; &#x62F;&#x627;&#x634;&#x62A;&#x647; &#x628;&#x627;&#x634;&#x6CC;&#x62F;. (&#x62A;&#x631;&#x62C;&#x6CC;&#x62D;&#x627; &#x645;&#x633;&#x6CC;&#x631; &#x646;&#x635;&#x628; &#x67E;&#x6CC;&#x634;&#x200C;&#x641;&#x631;&#x636; &#x631;&#x627; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x646;&#x62F;&#x647;&#x6CC;&#x62F;.))</p>
<p>&#x627;&#x648;&#x644;&#x6CC;&#x646; &#x628;&#x627;&#x631;&#x6CC; &#x6A9;&#x647; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x646;&#x635;&#x628; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F; &#x646;&#x6CC;&#x627;&#x632; &#x62F;&#x627;&#x631;&#x6CC;&#x62F; &#x6A9;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x62D;&#x6CC;&#x637;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x628;&#x627; &#x62A;&#x648;&#x62C;&#x647; &#x628;&#x647; &#x645;&#x62D;&#x644; &#x646;&#x635;&#x628; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x631;&#x648;&#x632; &#x631;&#x633;&#x627;&#x646;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x641;&#x631;&#x636; &#x6A9;&#x646;&#x6CC;&#x645; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x62F;&#x631; &#x686;&#x646;&#x6CC;&#x646; &#x622;&#x62F;&#x631;&#x633;&#x6CC; &#x646;&#x635;&#x628; &#x6A9;&#x631;&#x62F;&#x647;&#x200C;&#x627;&#x6CC;&#x62F;:</p>
<p>&#x200D;<code>c:\Program Files\java\jdk</code> </p>
<p>&#x62D;&#x627;&#x644; &#x631;&#x648;&#x6CC; My Computer &#x631;&#x627;&#x633;&#x62A; &#x6A9;&#x644;&#x6CC;&#x6A9; &#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x6AF;&#x632;&#x6CC;&#x646;&#x647;&#x200C;&#x6CC; Properties &#x631;&#x627; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x628;&#x647; &#x62A;&#x628; Advanced &#x631;&#x641;&#x62A;&#x647; &#x648; &#x631;&#x648;&#x6CC; &#x62F;&#x6A9;&#x645;&#x647;&#x200C;&#x6CC; Environment Variables &#x6A9;&#x644;&#x6CC;&#x6A9; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x627;&#x6CC;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; PATH &#x631;&#x627; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x628;&#x62F;&#x647;&#x6CC;&#x62F; &#x648; &#x645;&#x633;&#x6CC;&#x631; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x646;&#x6CC;&#x632; &#x628;&#x647; &#x622;&#x646; &#x627;&#x636;&#x627;&#x641;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x627;&#x6AF;&#x631; &#x62F;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; PATH &#x645;&#x642;&#x62F;&#x627;&#x631; &#x642;&#x628;&#x644;&#x6CC; &#x627;&#x6CC; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x634;&#x62A; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x62C;&#x62F;&#x6CC;&#x62F; &#x631;&#x627; &#x628;&#x627; &#x6CC;&#x6A9; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x646;&#x642;&#x637;&#x647;-&#x648;&#x6CC;&#x631;&#x6AF;&#x648;&#x644; &quot;;&quot; &#x627;&#x632; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x642;&#x628;&#x644;&#x6CC; &#x62C;&#x62F;&#x627; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p> &#x62F;&#x631; &#x627;&#x6CC;&#x646;&#x62C;&#x627; &#x641;&#x631;&#x636; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x645; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627;&#x6CC; &#x634;&#x645;&#x627; &#x62F;&#x631; &#x645;&#x633;&#x6CC;&#x631; <code>c:\Program Files\java\jdk\bin</code> &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x648; &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; PATH &#x634;&#x645;&#x627; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x642;&#x628;&#x644;&#x6CC;&#x200C;&#x627;&#x6CC; &#x645;&#x627;&#x646;&#x646;&#x62F; <code>C:\WINDOWS\SYSTEM32</code> &#x631;&#x627; &#x62F;&#x627;&#x631;&#x627; &#x627;&#x633;&#x62A;. &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6CC;&#x6A9; &#x6A9;&#x627;&#x631;&#x627;&#x6A9;&#x62A;&#x631; &#x646;&#x642;&#x637;&#x647;-&#x648;&#x6CC;&#x631;&#x6AF;&#x648;&#x644; &#x62F;&#x631; &#x645;&#x642;&#x627;&#x628;&#x644; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x642;&#x628;&#x644;&#x6CC; PATH &#x642;&#x631;&#x627;&#x631; &#x62F;&#x647;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x62C;&#x62F;&#x6CC;&#x62F; &#x6A9;&#x647; &#x647;&#x645;&#x627;&#x646; &#x645;&#x633;&#x6CC;&#x631; &#x641;&#x627;&#x6CC;&#x644;&#x200C;&#x647;&#x627;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC;&#x6CC; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x631;&#x627; &#x628;&#x647; &#x622;&#x646; &#x627;&#x636;&#x627;&#x641;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x6CC;&#x639;&#x646;&#x6CC; &#x62F;&#x631; &#x646;&#x647;&#x627;&#x6CC;&#x62A; &#x628;&#x627;&#x6CC;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; PATH &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x634;&#x645;&#x627; &#x686;&#x6CC;&#x632;&#x6CC; &#x634;&#x628;&#x6CC;&#x647; &#x628;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x632;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x62F;:</p>
<p><code>C:\WINDOWS\SYSTEM32;c:\Program Files\java\jdk\bin</code></p>
<p>&#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x62F;&#x631; &#x635;&#x648;&#x631;&#x62A;&#x6CC; &#x6A9;&#x647; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x645;&#x62D;&#x6CC;&#x637;&#x6CC; PATH &#x634;&#x645;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x67E;&#x6CC;&#x634;&#x200C;&#x641;&#x631;&#x636; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x62F;&#x627;&#x631;&#x627;&#x60C; &#x646;&#x628;&#x648;&#x62F; &#x6A9;&#x627;&#x641;&#x6CC; &#x627;&#x633;&#x62A; &#x641;&#x642;&#x637; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x62C;&#x62F;&#x6CC;&#x62F; &#x631;&#x627; &#x627;&#x636;&#x627;&#x641;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6CC;&#x639;&#x646;&#x6CC; &#x628;&#x627;&#x6CC;&#x62F; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; PATH &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x634;&#x645;&#x627; &#x686;&#x6CC;&#x632;&#x6CC; &#x634;&#x628;&#x6CC;&#x647; &#x628;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x632;&#x6CC;&#x631; &#x628;&#x627;&#x634;&#x62F;:</p>
<p><code>c:\Program Files\java\jdk\bin</code></p>
<p>&#x642;&#x628;&#x644; &#x627;&#x632; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x645;&#x62D;&#x6CC;&#x637;&#x6CC; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x62A;&#x63A;&#x6CC;&#x6CC;&#x631; &#x62F;&#x647;&#x6CC;&#x62F; &#x62D;&#x62A;&#x645;&#x627; &#x645;&#x62D;&#x644; &#x646;&#x635;&#x628; jdk &#x648; &#x67E;&#x648;&#x634;&#x647;&#x200C;&#x6CC; bin &#x62F;&#x631;&#x648;&#x646; &#x622;&#x646; &#x631;&#x627; &#x628;&#x631;&#x631;&#x633;&#x6CC; &#x6A9;&#x631;&#x62F;&#x647; &#x648; &#x622;&#x62F;&#x631;&#x633; &#x62F;&#x642;&#x6CC;&#x642; &#x648; &#x62F;&#x631;&#x633;&#x62A; &#x631;&#x627; &#x62C;&#x627;&#x6CC;&#x6AF;&#x632;&#x6CC;&#x646; &#x6A9;&#x646;&#x6CC;&#x62F;. </p>
<p>&#x62D;&#x627;&#x644; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x637;&#x645;&#x6CC;&#x646;&#x627;&#x646; &#x627;&#x632; &#x646;&#x635;&#x628; &#x635;&#x62D;&#x6CC;&#x62D; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x62F;&#x648; &#x641;&#x631;&#x645;&#x627;&#x646; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x6CC;&#x6A9; &#x62E;&#x637; &#x641;&#x631;&#x645;&#x627;&#x646; (CMD) &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<p><code>java -version</code></p>
<p><code>javac -version</code></p>
<p>&#x627;&#x6AF;&#x631; &#x62F;&#x631; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x627;&#x6CC;&#x646; &#x62F;&#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x648; &#x62C;&#x627;&#x648;&#x627;&#x633;&#x6CC; &#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F;&#x60C; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646; &#x627;&#x632; &#x646;&#x635;&#x628; &#x648; &#x62A;&#x646;&#x638;&#x6CC;&#x645; &#x635;&#x62D;&#x6CC;&#x62D; &#x645;&#x62A;&#x63A;&#x6CC;&#x631; &#x645;&#x62D;&#x644;&#x6CC; &#x627;&#x637;&#x645;&#x6CC;&#x646;&#x627;&#x646; &#x62F;&#x627;&#x634;&#x62A;.</p>
<h4 id="&#x645;&#x6A9;&#x6CC;&#x646;&#x62A;&#x627;&#x634;">&#x645;&#x6A9;&#x6CC;&#x646;&#x62A;&#x627;&#x634;</h4>
<p>&#x62C;&#x647;&#x62A; &#x646;&#x635;&#x628; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647; &#x62F;&#x631; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644; &#x645;&#x6A9;&#x6CC;&#x646;&#x62A;&#x627;&#x634; &#x641;&#x642;&#x637; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x628;&#x647; <a href="http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html" target="_blank">&#x627;&#x6CC;&#x646; &#x644;&#x6CC;&#x646;&#x6A9;</a> &#x628;&#x631;&#x648;&#x6CC;&#x62F; &#x648; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; &#x645;&#x62A;&#x646;&#x627;&#x633;&#x628; &#x628;&#x627; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x62F;&#x627;&#x646;&#x644;&#x648;&#x62F; &#x6A9;&#x631;&#x62F;&#x647; &#x648; &#x628;&#x647; &#x633;&#x627;&#x62F;&#x6AF;&#x6CC; &#x645;&#x627;&#x646;&#x646;&#x62F; &#x628;&#x6CC;&#x634;&#x62A;&#x631; &#x646;&#x631;&#x645; &#x627;&#x641;&#x632;&#x627;&#x631;&#x647;&#x627; &#x622;&#x646; &#x631;&#x627; &#x646;&#x635;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x633;&#x67E;&#x633; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x627;&#x62A; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x6CC;&#x6A9; &#x62A;&#x631;&#x645;&#x6CC;&#x646;&#x627;&#x644; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x62F;:</p>
<p><code>java -version</code></p>
<p><code>javac -version</code></p>
<p>&#x627;&#x6AF;&#x631; &#x62F;&#x631; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x627;&#x6CC;&#x646; &#x62F;&#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x648; &#x62C;&#x627;&#x648;&#x627;&#x633;&#x6CC; &#x631;&#x627; &#x645;&#x634;&#x627;&#x647;&#x62F;&#x647; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F;&#x60C; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647; &#x628;&#x647; &#x62F;&#x631;&#x633;&#x62A;&#x6CC; &#x646;&#x635;&#x628; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;.</p>
<h4 id="&#x6AF;&#x646;&#x648;&#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633;">&#x6AF;&#x646;&#x648;/&#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633;</h4>
<p>&#x62F;&#x631; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644; &#x6AF;&#x646;&#x648;/&#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633; &#x62A;&#x648;&#x635;&#x6CC;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F; &#x628;&#x647; &#x62C;&#x627;&#x6CC; &#x627;&#x648;&#x631;&#x627;&#x6A9;&#x644; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x627;&#x632; OpenJDK &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x645;&#x62E;&#x627;&#x632;&#x646; &#x62A;&#x645;&#x627;&#x645; &#x62A;&#x648;&#x632;&#x6CC;&#x639;&#x200C;&#x647;&#x627; &#x645;&#x648;&#x62C;&#x648;&#x62F; &#x627;&#x633;&#x62A; &#x648; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; &#x645;&#x646;&#x627;&#x633;&#x628;&#x200C;&#x62A;&#x631;&#x6CC; &#x646;&#x633;&#x628;&#x62A; &#x628;&#x647; &#x627;&#x648;&#x631;&#x627;&#x6A9;&#x644; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x633;&#x62A;. &#x628;&#x631;&#x627;&#x6CC; &#x646;&#x635;&#x628; OpenJDK &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; 8 &#x62F;&#x631; &#x62A;&#x648;&#x632;&#x6CC;&#x639;&#x200C;&#x647;&#x627;&#x6CC; &#x645;&#x62E;&#x62A;&#x644;&#x641; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x627;&#x632; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x627;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x62F;&#x628;&#x6CC;&#x627;&#x646; &#x648; &#x627;&#x648;&#x628;&#x648;&#x646;&#x62A;&#x648;:</p>
<pre><code>$ sudo apt install openjdk-8-jdk
</code></pre><p>&#x641;&#x62F;&#x648;&#x631;&#x627;:</p>
<pre><code class="lang-text">$ sudo dnf install java-1.8.0-openjdk
</code></pre>
<p>&#x622;&#x631;&#x686; &#x644;&#x6CC;&#x646;&#x648;&#x6A9;&#x633;:</p>
<pre><code class="lang-text">$ sudo pacman -S jdk8-openjdk
</code></pre>
<p>&#x62F;&#x631; &#x62D;&#x627;&#x644; &#x62D;&#x627;&#x636;&#x631; &#x62A;&#x642;&#x631;&#x6CC;&#x628;&#x627; &#x62F;&#x631; &#x645;&#x62E;&#x627;&#x632;&#x646; &#x628;&#x633;&#x6CC;&#x627;&#x631;&#x6CC; &#x627;&#x632; &#x62A;&#x648;&#x632;&#x6CC;&#x639;&#x200C;&#x647;&#x627;  OpenJDK &#x62A;&#x627; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; 11 &#x646;&#x6CC;&#x632; &#x648;&#x62C;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x62F; &#x627;&#x645;&#x627; &#x645;&#x631;&#x633;&#x648;&#x645; &#x62A;&#x631;&#x6CC;&#x646; &#x646;&#x633;&#x62E;&#x647; &#x62A;&#x627; &#x628;&#x647; &#x627;&#x6CC;&#x646; &#x644;&#x62D;&#x638;&#x647; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x6CC; 8 &#x622;&#x646; &#x627;&#x633;&#x62A;. (&#x646;&#x635;&#x628; &#x646;&#x633;&#x62E;&#x647;&#x200C;&#x647;&#x627;&#x6CC; &#x628;&#x627;&#x644;&#x627;&#x62A;&#x631; &#x646;&#x6CC;&#x632; &#x645;&#x627;&#x646;&#x639;&#x6CC; &#x646;&#x62F;&#x627;&#x631;&#x62F;.)</p>
<p>&#x67E;&#x633; &#x627;&#x632; &#x646;&#x635;&#x628; &#x628;&#x633;&#x62A;&#x647;&#x200C;&#x6CC; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x632; &#x645;&#x62E;&#x627;&#x632;&#x646; &#x631;&#x633;&#x645;&#x6CC;&#x60C; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x637;&#x645;&#x6CC;&#x646;&#x627;&#x646; &#x627;&#x632; &#x646;&#x635;&#x628; &#x648; &#x6A9;&#x627;&#x631;&#x6A9;&#x631;&#x62F; &#x635;&#x62D;&#x6CC;&#x62D; &#x622;&#x646; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x62F;&#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x632;&#x6CC;&#x631; &#x631;&#x627; &#x62F;&#x631; &#x6CC;&#x6A9; &#x62A;&#x631;&#x645;&#x6CC;&#x646;&#x627;&#x644; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x627;&#x6AF;&#x631; &#x628;&#x627; &#x62E;&#x631;&#x648;&#x62C;&#x6CC; &#x645;&#x634;&#x627;&#x628;&#x647; &#x631;&#x648;&#x628;&#x631;&#x648; &#x634;&#x62F;&#x6CC;&#x62F;&#x60C; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627; &#x62F;&#x631; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631; &#x634;&#x645;&#x627; &#x628;&#x647; &#x62F;&#x631;&#x633;&#x62A;&#x6CC; &#x646;&#x635;&#x628; &#x634;&#x62F;&#x647; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-text">&#x279C;  ~ java -version
openjdk version &quot;1.8.0_172&quot;
OpenJDK Runtime Environment (build 1.8.0_172-b11)
OpenJDK 64-Bit Server VM (build 25.172-b11, mixed mode)
</code></pre>
<pre><code class="lang-text">&#x279C;  ~ javac -version
javac 1.8.0_172
</code></pre>
<p>&#x628;&#x62F;&#x6CC;&#x646; &#x62A;&#x631;&#x62A;&#x6CC;&#x628; &#x634;&#x645;&#x627; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x6A9;&#x6CC;&#x62A; &#x62A;&#x648;&#x633;&#x639;&#x647;&#x200C;&#x6CC; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x6A9;&#x647; &#x645;&#x62C;&#x645;&#x648;&#x639;&#x647;&#x200C;&#x627;&#x6CC; &#x627;&#x632; &#x627;&#x628;&#x632;&#x627;&#x631;&#x647;&#x627;&#x6CC; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x6CC;&#x627;&#x632; &#x628;&#x631;&#x627;&#x6CC; &#x628;&#x631;&#x646;&#x627;&#x645;&#x647; &#x646;&#x648;&#x6CC;&#x633;&#x6CC; &#x648; &#x62A;&#x648;&#x633;&#x639;&#x647; &#x628;&#x647; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x631;&#x627; &#x62A;&#x634;&#x6A9;&#x6CC;&#x644; &#x645;&#x6CC;&#x200C;&#x62F;&#x647;&#x62F; &#x631;&#x627; &#x631;&#x648;&#x6CC; &#x6A9;&#x627;&#x645;&#x67E;&#x6CC;&#x648;&#x62A;&#x631; &#x62E;&#x648;&#x62F; &#x628;&#x627; &#x647;&#x631; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x639;&#x627;&#x645;&#x644;&#x6CC; &#x6A9;&#x647; &#x627;&#x632; &#x622;&#x646; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x646;&#x635;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="overview.html" class="navigation navigation-prev " aria-label="Previous page: نگاهی اجمالی به جاوا">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="text-editor-or-ide.html" class="navigation navigation-next " aria-label="Next page: تکست ادیتور یا آی‌دی‌ای؟">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"نصب کیت توسعه","level":"1.4","depth":1,"next":{"title":"تکست ادیتور یا آی‌دی‌ای؟","level":"1.5","depth":1,"path":"text-editor-or-ide.md","ref":"text-editor-or-ide.md","articles":[]},"previous":{"title":"نگاهی اجمالی به جاوا","level":"1.3","depth":1,"path":"overview.md","ref":"overview.md","articles":[]},"dir":"rtl"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"install-jdk.md","mtime":"2018-08-14T12:52:34.987Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-14T14:36:40.888Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

