
<!DOCTYPE HTML>
<html lang="" dir="rtl">
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>متدها - کامل نشده · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="modifiers.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    بیا جاوا یاد بگیریم
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction.html">
            
                <a href="introduction.html">
            
                    
                    مقدمه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    نگاهی اجمالی به جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="install-jdk.html">
            
                <a href="install-jdk.html">
            
                    
                    نصب کیت توسعه
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="text-editor-or-ide.html">
            
                <a href="text-editor-or-ide.html">
            
                    
                    تکست ادیتور یا آی‌دی‌ای؟
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="basic-subjects.html">
            
                <a href="basic-subjects.html">
            
                    
                    مسائل ابتدایی جاوا
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="classes-and-objects.html">
            
                <a href="classes-and-objects.html">
            
                    
                    کلاس‌ها و اشیاء
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="variables.html">
            
                <a href="variables.html">
            
                    
                    متغیرها
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="modifiers.html">
            
                <a href="modifiers.html">
            
                    
                    اصلاح کننده‌ها - کامل نشده
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="methods.html">
            
                <a href="methods.html">
            
                    
                    متدها - کامل نشده
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >متدها - کامل نشده</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="methods">&#x645;&#x62A;&#x62F;&#x647;&#x627; - &#x6A9;&#x627;&#x645;&#x644; &#x646;&#x634;&#x62F;&#x647; </h1>
<h3 id="&#x627;&#x6CC;&#x646;-&#x628;&#x62E;&#x634;-&#x647;&#x646;&#x648;&#x632;-&#x6A9;&#x627;&#x645;&#x644;-&#x646;&#x6CC;&#x633;&#x62A;--&#x628;&#x647;&#x62A;&#x631;-&#x627;&#x633;&#x62A;-&#x62A;&#x627;-&#x62A;&#x6A9;&#x645;&#x6CC;&#x644;-&#x634;&#x62F;&#x646;-&#x622;&#x646;-&#x645;&#x646;&#x62A;&#x638;&#x631;-&#x628;&#x645;&#x627;&#x646;&#x6CC;&#x62F;-&#x648;-&#x633;&#x67E;&#x633;-&#x645;&#x637;&#x627;&#x644;&#x639;&#x647;-&#x6A9;&#x646;&#x6CC;&#x62F;">*** &#x627;&#x6CC;&#x646; &#x628;&#x62E;&#x634; &#x647;&#x646;&#x648;&#x632; &#x6A9;&#x627;&#x645;&#x644; &#x646;&#x6CC;&#x633;&#x62A; :) &#x628;&#x647;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x62A;&#x627; &#x62A;&#x6A9;&#x645;&#x6CC;&#x644; &#x634;&#x62F;&#x646; &#x622;&#x646; &#x645;&#x646;&#x62A;&#x638;&#x631; &#x628;&#x645;&#x627;&#x646;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x645;&#x637;&#x627;&#x644;&#x639;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;.***</h3>
<p>&#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627;&#x60C; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x62C;&#x645;&#x639;&#x6CC; &#x627;&#x632; &#x6AF;&#x632;&#x627;&#x631;&#x647;&#x200C;&#x647;&#x627; &#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631;&#x627;&#x62A; &#x647;&#x633;&#x62A;&#x646;&#x62F; &#x6A9;&#x647; &#x62F;&#x631; &#x6A9;&#x646;&#x627;&#x631; &#x647;&#x645; &#x6A9;&#x627;&#x631; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x646;&#x62F; &#x62A;&#x627; &#x639;&#x645;&#x644;&#x6CC; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x646;&#x62F;. &#x645;&#x639;&#x631;&#x648;&#x641; &#x62A;&#x631;&#x6CC;&#x646; &#x645;&#x62A;&#x62F;&#x6CC; &#x6A9;&#x647; &#x62A;&#x627; &#x628;&#x647; &#x627;&#x645;&#x631;&#x648;&#x632; &#x628;&#x627; &#x622;&#x646; &#x6A9;&#x627;&#x631; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645;&#x60C; <code>System.out.println</code>&#x627;&#x633;&#x62A; &#x6A9;&#x647; &#x62F;&#x631; &#x648;&#x627;&#x642;&#x639; &#x628;&#x627; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x622;&#x646; &#x633;&#x6CC;&#x633;&#x62A;&#x645; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x6AF;&#x632;&#x627;&#x631;&#x647; &#x648; &#x62F;&#x633;&#x62A;&#x648;&#x631; &#x631;&#x627; &#x627;&#x632; &#x62F;&#x631;&#x648;&#x646; &#x645;&#x62A;&#x62F; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x627;&#x646;&#x62F; &#x648; &#x627;&#x62C;&#x631;&#x627; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x62F; &#x62A;&#x627; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x6A9;&#x647; &#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x6A9;&#x631;&#x62F;&#x647; &#x631;&#x627; &#x686;&#x627;&#x67E; &#x6A9;&#x646;&#x62F;.</p>
<h3 id="&#x686;&#x6AF;&#x648;&#x646;&#x647;-&#x645;&#x62A;&#x62F;&#x647;&#x627;&#x6CC;&#x200C;&#x645;&#x627;&#x646;-&#x631;&#x627;-&#x62A;&#x639;&#x631;&#x6CC;&#x641;-&#x6A9;&#x646;&#x6CC;&#x645;&#x61F;">&#x686;&#x6AF;&#x648;&#x646;&#x647; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x6CC;&#x200C;&#x645;&#x627;&#x646; &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x6A9;&#x646;&#x6CC;&#x645;&#x61F;</h3>
<p>&#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x628;&#x62E;&#x634; &#x6CC;&#x627;&#x62F; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x6CC;&#x645; &#x6A9;&#x647; &#x686;&#x6AF;&#x648;&#x646;&#x647; &#x645;&#x62A;&#x62F;&#x647;&#x627;&#x6CC; &#x62E;&#x648;&#x62F;&#x645;&#x627;&#x646; &#x631;&#x627; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x645; &#x648; &#x622;&#x646;&#x200C;&#x647;&#x627; &#x631;&#x627; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645;.</p>
<p>&#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x6A9;&#x644;&#x6CC; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x645;&#x62A;&#x62F; &#x62F;&#x631; &#x632;&#x628;&#x627;&#x646; &#x62C;&#x627;&#x648;&#x627; &#x628;&#x647; &#x635;&#x648;&#x631;&#x62A; &#x632;&#x6CC;&#x631; &#x627;&#x633;&#x62A;:</p>
<pre><code class="lang-java"><span class="hljs-function">returnType <span class="hljs-title">methodName</span><span class="hljs-params">(argumentType argument)</span> </span>{
    <span class="hljs-comment">// method content</span>
}
</code></pre>
<p>&#x6F1; . Return Type : &#x628;&#x631;&#x627;&#x6CC; &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x645;&#x62A;&#x62F; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x646;&#x648;&#x639; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x6A9;&#x647; &#x62A;&#x627;&#x628;&#x639; &#x628;&#x631;&#x645;&#x6CC;&#x200C;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F; &#x631;&#x627; &#x645;&#x634;&#x62E;&#x635; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62B;&#x627;&#x644; &#x627;&#x6AF;&#x647; &#x62A;&#x627;&#x628;&#x639; &#x634;&#x645;&#x627; &#x6CC;&#x6A9; &#x639;&#x62F;&#x62F; &#x635;&#x62D;&#x6CC;&#x62D; &#x627;&#x632; &#x646;&#x648;&#x639; int &#x6CC;&#x627; &#x6CC;&#x6A9; &#x631;&#x634;&#x62A;&#x647; &#x628;&#x631;&#x645;&#x6CC;&#x200C;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F; &#x628;&#x627;&#x6CC;&#x62F; &#x622;&#x646; &#x631;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x6CC;&#x6AF;&#x627;&#x647; returnType &#x628;&#x646;&#x648;&#x6CC;&#x633;&#x6CC;&#x62F;. &#x647;&#x645;&#x686;&#x646;&#x6CC;&#x646; &#x62A;&#x645;&#x627;&#x645; &#x627;&#x646;&#x648;&#x627;&#x639; &#x62F;&#x627;&#x62F;&#x647;&#x200C;&#x647;&#x627; &#x62F;&#x631; &#x62C;&#x627;&#x648;&#x627; &#x6A9;&#x647; &#x62F;&#x631; &#x628;&#x62E;&#x634; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x647;&#x627; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x6A9;&#x631;&#x62F;&#x6CC;&#x645; &#x645;&#x6CC;&#x200C;&#x62A;&#x648;&#x627;&#x646;&#x646;&#x62F; &#x646;&#x648;&#x639; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x628;&#x627;&#x634;&#x646;&#x62F; &#x6A9;&#x647; &#x645;&#x62A;&#x62F; &#x634;&#x645;&#x627; &#x622;&#x646; &#x631;&#x627; &#x628;&#x631;&#x645;&#x6CC;&#x200C;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F;. &#x62D;&#x627;&#x644; &#x627;&#x6AF;&#x631; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x645;&#x62A;&#x62F;&#x6CC; &#x628;&#x633;&#x627;&#x632;&#x6CC;&#x62F; &#x6A9;&#x647; &#x645;&#x642;&#x62F;&#x627;&#x631;&#x6CC; &#x631;&#x627; &#x628;&#x631;&#x646;&#x6AF;&#x631;&#x62F;&#x627;&#x646;&#x62F;&#x60C; &#x628;&#x627;&#x6CC;&#x62F; &#x627;&#x632; &#x6A9;&#x644;&#x6CC;&#x62F; &#x648;&#x627;&#x698;&#x647;&#x200C;&#x6CC; <code>void</code>&#x628;&#x647; &#x639;&#x646;&#x648;&#x627;&#x646; Return Type &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;.</p>
<p>&#x6F2;. Method Name : &#x62F;&#x631; &#x627;&#x6CC;&#x646; &#x642;&#x633;&#x645;&#x62A; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x631;&#x627;&#x6CC; &#x645;&#x62A;&#x62F; &#x62E;&#x648;&#x62F; &#x6CC;&#x6A9; &#x646;&#x627;&#x645; &#x627;&#x646;&#x62A;&#x62E;&#x627;&#x628; &#x6A9;&#x646;&#x6CC;&#x62F;. &#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F; &#x6A9;&#x647; &#x646;&#x627;&#x645; &#x645;&#x62A;&#x62F; &#x628;&#x627;&#x6CC;&#x62F; &#x628;&#x627; &#x6CC;&#x6A9; &#x62D;&#x631;&#x641; &#x6A9;&#x648;&#x686;&#x6A9; &#x622;&#x63A;&#x627;&#x632; &#x634;&#x648;&#x62F; &#x648; &#x627;&#x6AF;&#x631; &#x646;&#x627;&#x645; &#x634;&#x627;&#x645;&#x644; &#x686;&#x646;&#x62F;&#x6CC;&#x646; &#x6A9;&#x644;&#x645;&#x647; &#x628;&#x648;&#x62F;&#x60C; &#x628;&#x647; &#x62C;&#x632; &#x6A9;&#x644;&#x645;&#x647;&#x200C;&#x6CC; &#x627;&#x648;&#x644;&#x60C; &#x647;&#x631; &#x6A9;&#x644;&#x645;&#x647; &#x628;&#x627; &#x62D;&#x631;&#x648;&#x641; &#x628;&#x632;&#x631;&#x6AF; &#x622;&#x63A;&#x627;&#x632; &#x634;&#x648;&#x62F;. &#x645;&#x62B;&#x644;&#x627;: <code>myNewMethod</code>.</p>
<p>&#x6F3;. argument type : &#x628;&#x631;&#x627;&#x6CC; &#x62A;&#x648;&#x636;&#x6CC;&#x62D; &#x627;&#x6CC;&#x646; &#x628;&#x62E;&#x634;&#x60C; &#x628;&#x647;&#x62A;&#x631; &#x627;&#x633;&#x62A; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x6CC;&#x6A9;&#x6CC; &#x627;&#x632; &#x645;&#x641;&#x627;&#x647;&#x6CC;&#x645; &#x645;&#x647;&#x645; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x631;&#x627; &#x645;&#x639;&#x631;&#x641;&#x6CC; &#x6A9;&#x646;&#x6CC;&#x645;! &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x200C;&#x647;&#x627;!</p>
<h3 id="&#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x200C;&#x647;&#x627;">&#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x200C;&#x647;&#x627;</h3>
<p>&#x647;&#x645;&#x627;&#x646;&#x200C;&#x637;&#x648;&#x631; &#x6A9;&#x647; &#x62A;&#x627; &#x6A9;&#x646;&#x648;&#x646; &#x62F;&#x6CC;&#x62F;&#x6CC;&#x62F; &#x62A;&#x645;&#x627;&#x645;&#x6CC; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x686;&#x647; &#x645;&#x648;&#x642;&#x639; &#x633;&#x627;&#x62E;&#x62A; &#x648; &#x686;&#x647; &#x645;&#x648;&#x642;&#x639; &#x627;&#x62C;&#x631;&#x627; &#x6CC;&#x6A9; &#x62C;&#x641;&#x62A; &#x639;&#x644;&#x627;&#x645;&#x62A; &#x67E;&#x631;&#x627;&#x646;&#x62A;&#x632; () &#x62F;&#x631; &#x645;&#x642;&#x627;&#x628;&#x644; &#x62E;&#x648;&#x62F; &#x62F;&#x627;&#x631;&#x646;&#x62F;. &#x627;&#x62D;&#x62A;&#x645;&#x627;&#x644;&#x627; &#x628;&#x631;&#x627;&#x6CC;&#x200C;&#x62A;&#x627;&#x646; &#x633;&#x648;&#x627;&#x644; &#x67E;&#x6CC;&#x634; &#x622;&#x645;&#x62F;&#x647; &#x6A9;&#x647; &#x627;&#x6CC;&#x646; &#x67E;&#x631;&#x627;&#x646;&#x62A;&#x632; &#x628;&#x647; &#x686;&#x647; &#x62F;&#x631;&#x62F; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x631;&#x62F;&#x61F; &#x67E;&#x631;&#x627;&#x646;&#x62A;&#x632;&#x6CC; &#x6A9;&#x647; &#x645;&#x642;&#x627;&#x628;&#x644; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x642;&#x631;&#x627;&#x631; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x62F;&#x60C; &#x645;&#x62D;&#x644; &#x642;&#x631;&#x627;&#x631; &#x6AF;&#x6CC;&#x631;&#x6CC; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x200C;&#x647;&#x627;&#x6CC; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A;&#x6CC; &#x645;&#x62A;&#x62F; &#x627;&#x633;&#x62A;. &#x62F;&#x631; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x633;&#x627;&#x62E;&#x62A; &#x645;&#x62A;&#x62F; &#x647;&#x631; &#x646;&#x648;&#x639; &#x645;&#x62A;&#x63A;&#x6CC;&#x631;&#x6CC; &#x648; &#x6CC;&#x627; &#x645;&#x642;&#x62F;&#x627;&#x631; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x6CC; &#x631;&#x627; &#x6A9;&#x647; &#x645;&#x634;&#x62E;&#x635; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x62F;&#x631; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x645;&#x62A;&#x62F; &#x646;&#x6CC;&#x632; &#x628;&#x627;&#x6CC;&#x62F; &#x622;&#x646; &#x631;&#x627; &#x628;&#x647; &#x645;&#x62A;&#x62F; &#x628;&#x62F;&#x647;&#x6CC;&#x62F; &#x62A;&#x627; &#x6A9;&#x627;&#x631; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x62F;&#x647;&#x62F;. &#x62A;&#x639;&#x6CC;&#x6CC;&#x646; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x62F;&#x631; &#x645;&#x62A;&#x62F;&#x647;&#x627; &#x628;&#x647; &#x633;&#x627;&#x62F;&#x6AF;&#x6CC; &#x627;&#x646;&#x62C;&#x627;&#x645; &#x645;&#x6CC;&#x200C;&#x6AF;&#x6CC;&#x631;&#x62F; &#x628;&#x62F;&#x6CC;&#x646; &#x635;&#x648;&#x631;&#x62A; &#x6A9;&#x647; &#x627;&#x628;&#x62A;&#x62F;&#x627; &#x646;&#x648;&#x639; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x6CC; &#x6A9;&#x647; &#x645;&#x6CC;&#x200C;&#x62E;&#x648;&#x627;&#x647;&#x6CC;&#x62F; &#x645;&#x62A;&#x62F; &#x62F;&#x631;&#x6CC;&#x627;&#x641;&#x62A; &#x6A9;&#x646;&#x62F; &#x631;&#x627; &#x645;&#x634;&#x62E;&#x635; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x648; &#x633;&#x67E;&#x633; &#x646;&#x627;&#x645; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646; &#x645;&#x648;&#x631;&#x62F; &#x646;&#x638;&#x631;.</p>
<p>&#x6F4;. &#x648; &#x627;&#x645;&#x627; &#x62F;&#x631; &#x627;&#x62F;&#x627;&#x645;&#x647;&#x200C;&#x6CC; &#x627;&#x62C;&#x632;&#x627;&#x6CC; &#x633;&#x6CC;&#x646;&#x62A;&#x6A9;&#x633; &#x645;&#x62A;&#x62F; &#x6CC;&#x6A9; &#x62C;&#x641;&#x62A; &#x622;&#x6A9;&#x648;&#x644;&#x627;&#x62F; &quot;{}&quot; &#x62F;&#x627;&#x631;&#x6CC;&#x645; &#x6A9;&#x647; &#x647;&#x645;&#x6CC;&#x634;&#x647; &#x628;&#x631;&#x627;&#x6CC; &#x628;&#x627;&#x632; &#x648; &#x628;&#x633;&#x62A;&#x647; &#x6A9;&#x631;&#x62F;&#x646; &#x647;&#x631; &#x628;&#x644;&#x648;&#x6A9; &#x6A9;&#x62F;&#x6CC; &#x627;&#x633;&#x62A;&#x641;&#x627;&#x62F;&#x647; &#x645;&#x6CC;&#x200C;&#x634;&#x648;&#x62F;.</p>
<h3 id="&#x686;&#x6AF;&#x648;&#x646;&#x647;-&#x645;&#x62A;&#x62F;-&#x62E;&#x648;&#x62F;-&#x631;&#x627;-&#x627;&#x62C;&#x631;&#x627;-&#x6A9;&#x646;&#x6CC;&#x645;&#x61F;">&#x686;&#x6AF;&#x648;&#x646;&#x647; &#x645;&#x62A;&#x62F; &#x62E;&#x648;&#x62F; &#x631;&#x627; &#x627;&#x62C;&#x631;&#x627; &#x6A9;&#x646;&#x6CC;&#x645;&#x61F;</h3>
<p>&#x67E;&#x633; &#x627;&#x632; &#x627;&#x6CC;&#x646;&#x200C;&#x6A9;&#x647; &#x6CC;&#x6A9; &#x645;&#x62A;&#x62F; &#x646;&#x648;&#x634;&#x62A;&#x6CC;&#x62F;&#x60C; &#x628;&#x631;&#x627;&#x6CC; &#x627;&#x62C;&#x631;&#x627;&#x6CC; &#x622;&#x646; &#x6A9;&#x627;&#x641;&#x6CC;&#x633;&#x62A; &#x641;&#x642;&#x637; &#x622;&#x646; &#x631;&#x627; &#x641;&#x631;&#x627;&#x628;&#x62E;&#x648;&#x627;&#x646;&#x6CC;&#x62F; &#x62A;&#x627; &#x627;&#x62C;&#x631;&#x627; &#x634;&#x648;&#x62F;:</p>
<pre><code class="lang-java">methodName(argument);
</code></pre>
<p>&#x62A;&#x648;&#x62C;&#x647; &#x6A9;&#x646;&#x6CC;&#x62F;&#x60C; &#x622;&#x631;&#x6AF;&#x648;&#x645;&#x627;&#x646;&#x6CC; &#x6A9;&#x647; &#x648;&#x627;&#x631;&#x62F; &#x645;&#x6CC;&#x200C;&#x6A9;&#x646;&#x6CC;&#x62F; &#x62F;&#x642;&#x6CC;&#x642;&#x627; &#x628;&#x627;&#x6CC;&#x62F; &#x627;&#x632; &#x647;&#x645;&#x627;&#x646; &#x646;&#x648;&#x639;&#x6CC; &#x628;&#x627;&#x634;&#x62F; &#x6A9;&#x647; &#x647;&#x646;&#x6AF;&#x627;&#x645; &#x627;&#x6CC;&#x62C;&#x627;&#x62F; &#x645;&#x62A;&#x62F; &#x622;&#x646; &#x631;&#x627; &#x62A;&#x639;&#x631;&#x6CC;&#x641; &#x6A9;&#x631;&#x62F;&#x6CC;&#x62F;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="modifiers.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: اصلاح کننده‌ها - کامل نشده">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"متدها - کامل نشده","level":"1.10","depth":1,"previous":{"title":"اصلاح کننده‌ها - کامل نشده","level":"1.9","depth":1,"path":"modifiers.md","ref":"modifiers.md","articles":[]},"dir":"rtl"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"methods.md","mtime":"2018-08-17T10:22:08.707Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-17T17:25:56.237Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

